{
  "The Grainger College of Engineering": {
    "Computer Science": {
      "Algorithms & Theory of Computation": "The fundamental study of efficient computation, formal languages, and complexity, forming the mathematical foundation of computer science.",
      "Artificial Intelligence & Machine Learning": "The development of systems that can perceive, reason, learn, and act intelligently, mimicking human cognitive functions.",
      "Computer Architecture & Parallel Computing": "The design and organization of computer hardware systems, with a focus on multi-core processors and high-performance parallel processing.",
      "Computer Vision & Graphics": "The science of enabling computers to see and interpret the visual world, and the generation of synthetic images and animations.",
      "Databases & Information Systems": "The study of managing, querying, and extracting insights from large-scale structured and unstructured data.",
      "Human-Computer Interaction (HCI)": "The design and study of the interfaces between people (users) and computers, focusing on usability, accessibility, and user experience.",
      "Natural Language Processing (NLP)": "A field of AI focused on enabling computers to understand, interpret, and generate human language.",
      "Programming Languages & Software Engineering": "The principles of designing and implementing programming languages and the systematic engineering of reliable, efficient software.",
      "Scientific Computing & Numerical Methods": "The application of computational and numerical techniques to solve complex problems in science and engineering.",
      "Security & Privacy": "The theory and practice of protecting computer systems, networks, and data from attack, damage, or unauthorized access.",
      "Systems & Networking": "The study of the principles and design of operating systems, distributed systems, and computer networks."
    },
    "Electrical & Computer Engineering": {
      "Circuits & VLSI Design": "The design and fabrication of integrated circuits (ICs) and very-large-scale integration (VLSI) systems, from transistors to microprocessors.",
      "Communications": "The study of transmitting information over various channels, including wireless, optical, and wired systems.",
      "Control Systems": "The theory and application of controlling dynamic systems, ensuring stability and performance in areas like robotics and automation.",
      "Electromagnetics & Photonics": "The study of electromagnetic waves and light (photons), and their application in devices like antennas, lasers, and optical fibers.",
      "Microelectronics & Nanotechnology": "The design and fabrication of electronic devices at the micro and nano scales, including semiconductors and MEMS.",
      "Power & Energy Systems": "The generation, transmission, distribution, and control of electric power, with a focus on smart grids and renewable energy.",
      "Quantum Information Science": "An interdisciplinary field that applies the principles of quantum mechanics to computing and communication.",
      "Robotics & Autonomous Systems": "The design, construction, operation, and application of robots and autonomous intelligent systems.",
      "Signal & Image Processing": "The analysis, modification, and synthesis of signals, such as sound, images, and sensor data."
    },
    "Mechanical Science & Engineering": {
      "Biomechanics & Mechanobiology": "The study of the mechanical laws relating to the movement and structure of living organisms, from cells to whole bodies.",
      "Controls & Dynamics": "The study of the motion of systems and the application of feedback to control their behavior, including vibrations and acoustics.",
      "Design & Manufacturing": "The principles and processes of creating products and systems, from initial concept to industrial production and automation.",
      "Fluid Mechanics & Thermal Sciences": "The study of fluids in motion (gases and liquids) and the principles of heat and energy transfer.",
      "Solid Mechanics & Materials": "The study of the behavior of solid materials under external forces and stresses, including deformation and fracture."
    },
    "Civil & Environmental Engineering": {
      "Construction Engineering & Management": "The application of engineering and management principles to the planning, design, and construction of infrastructure projects.",
      "Environmental Engineering & Science": "The development of solutions to environmental problems, such as pollution control, water purification, and waste management.",
      "Geotechnical Engineering": "The branch of civil engineering concerned with the engineering behavior of earth materials like soil and rock.",
      "Structural Engineering & Materials": "The design and analysis of structures that support or resist loads, such as buildings, bridges, and dams.",
      "Sustainable & Resilient Infrastructure": "The design of infrastructure systems that are environmentally friendly, socially equitable, and robust against hazards and changing conditions.",
      "Transportation Engineering": "The application of engineering principles to the planning, design, operation, and management of transportation systems.",
      "Water Resources Engineering": "The management and engineering of systems to control and utilize water resources, such as rivers, groundwater, and reservoirs."
    },
    "Materials Science & Engineering": {
      "Biomaterials & Biomedical Devices": "The design and application of materials for use in the human body, such as implants, tissue scaffolds, and drug delivery systems.",
      "Ceramics & Glasses": "The study of the synthesis, structure, and properties of inorganic, non-metallic materials, including their use in electronics and structures.",
      "Computational Materials Science": "The use of computer simulations and data modeling to understand, predict, and design new materials.",
      "Electronic Materials & Photonics": "The study of materials used in electronic and optical devices, including semiconductors, photovoltaics, and dielectrics.",
      "Metals & Alloys": "The study of the physical and chemical properties of metallic materials and the design of new alloys for structural and functional applications.",
      "Polymers & Soft Materials": "The science of long-chain molecules (polymers) and other deformable materials like gels and colloids."
    },
    "Bioengineering": {
      "Biomedical Imaging & Sensing": "The development of technologies and techniques to visualize biological processes and structures, from the molecular to the organismal level.",
      "Cell & Tissue Engineering": "The creation of functional biological tissues in the lab for regenerative medicine, drug testing, and disease modeling.",
      "Computational & Systems Biology": "The use of computational models and data analysis to understand complex biological systems and networks.",
      "Neural Engineering & Neurotechnology": "The application of engineering principles to understand, repair, or enhance the function of the nervous system."
    },
    "Aerospace Engineering": {
      "Aerodynamics & Fluid Dynamics": "The study of the motion of air and other gases, and their interaction with moving bodies like aircraft and spacecraft.",
      "Astrodynamics & Orbital Mechanics": "The study of the motion of rockets and spacecraft under the influence of gravity and other forces.",
      "Control & Estimation": "The design of systems for guiding and controlling the motion and state of aerospace vehicles.",
      "Propulsion & Combustion": "The science and technology of generating thrust to power aircraft and spacecraft, including jet engines and rockets.",
      "Structures & Materials": "The study of the design and analysis of lightweight yet strong structures and materials for aerospace applications."
    },
    "Industrial & Enterprise Systems Engineering": {
      "Data Analytics & Decision Sciences": "The use of statistical and computational methods to analyze data and inform complex decision-making processes.",
      "Financial Engineering": "The application of mathematical and computational methods to solve problems in finance and manage financial risk.",
      "Human Factors & Ergonomics": "The science of designing systems, products, and environments to be safe, efficient, and comfortable for human use.",
      "Operations Research & Optimization": "The use of advanced analytical methods to help make better decisions in complex systems, such as supply chains and logistics.",
      "Systems Engineering & Design": "The interdisciplinary approach to designing and managing complex engineering systems over their life cycles."
    },
    "Nuclear, Plasma & Radiological Engineering": {
      "Fusion & Plasma Science": "The study of ionized gases (plasmas) and the quest to harness nuclear fusion as a source of clean energy.",
      "Nuclear Materials & Waste Management": "The study of materials for use in nuclear environments and the safe management and disposal of radioactive waste.",
      "Radiation, Instrumentation & Imaging": "The science of detecting and measuring radiation and its application in medical imaging, security, and industry.",
      "Reactor Physics & Thermal Hydraulics": "The study of the nuclear physics and fluid heat transfer that govern the operation of nuclear reactors."
    }
  },
  "College of Liberal Arts & Sciences": {
    "Biological sciences": {
      "Anthropology": "The interdisciplinary study of humanity, fusing archaeological evidence, historical texts, and ethnographic methods to understand peoples and cultures from the past to the present.",
      "Biochemistry": "A department within the School of MCB focused on discovering the fundamental principles supporting life.",
      "Biophysics & Quantitative Biology": "An interdisciplinary center to train students and foster research at the interface between the physical, computational, and life sciences to elucidate the physical basis of biological phenomena.",
      "Cell & Developmental Biology": "A department within the School of MCB focused on discovering the fundamental principles supporting life, from cells to organisms.",
      "Entomology": "A department within SIB exploring the biology of insects to address challenges in agriculture, human health, and biodiversity.",
      "Evolution, Ecology, and Behavior": "A department within SIB exploring the biological principles of how organisms interact with their environment and evolve over time.",
      "Integrative Biology": "An academic unit that tackles scientific challenges by exploring life at every scale—from molecules to ecosystems—across disciplines like Entomology, Plant Biology, and Evolution, Ecology & Behavior.",
      "Microbiology": "A department within the School of MCB focused on discovering the fundamental principles of life, with an emphasis on microorganisms.",
      "Molecular & Cellular Biology": "An academic unit that educates students and conducts research to discover the fundamental principles supporting life at all scales, from microbes to humans, across four departments.",
      "Molecular & Integrative Physiology": "A department within the School of MCB that strives to understand gene products and biological organization at multiple levels, from molecules and cells to tissues and whole organisms.",
      "Neuroscience Program": "An interdisciplinary program that fosters research and education at the intersection of multiple colleges to understand the brain and nervous system.",
      "Plant Biology": "A department within SIB that conducts research and training in plant biology, integrating across temporal scales and levels of biological organization, from biochemistry to ecology.",
      "Psychology": "The scientific study of the mind and behavior, from its biological basis to its social and cognitive processes."
    },
    "Language and culture": {
      "Classics": "An academic department that fosters inquiry into the languages, literatures, art, archaeology, histories, and philosophical traditions of ancient Greece and Rome and neighboring Mediterranean areas.",
      "Comparative & World Literature": "An academic program dedicated to the study of literature across national, linguistic, and cultural boundaries.",
      "East Asian Languages & Cultures": "An academic department focused on the languages, literatures, histories, and cultures of China, Japan, and Korea.",
      "Foreign Language Teacher Education Program": "An academic program dedicated to preparing students to become licensed teachers of foreign languages.",
      "French & Italian": "An academic department dedicated to enhancing undergraduate and graduate education in the languages, literatures, and cultures of the French- and Italian-speaking worlds.",
      "Germanic Languages & Literatures": "An academic department focused on the languages, literatures, and cultures of the Germanic-speaking world.",
      "Global Studies, LAS": "An academic program offering interdisciplinary study of global issues, cultures, and languages.",
      "Illinois Global Institute": "An institute that fosters collaboration on global and regional questions, bringing together various area studies centers with a shared commitment to international research.",
      "Jewish Culture & Society": "An academic program that provides insights into Judaism, Israel, and the Jewish experience by fusing archaeological evidence, historical texts, and Semitic inscriptions.",
      "Linguistics": "The scientific study of human language, including its structure, use, and cognitive basis.",
      "Literatures, Cultures & Linguistics": "An academic unit with a mission of 'transforming lives and serving society by educating, creating knowledge, and putting knowledge to work' across diverse languages and cultures.",
      "Slavic Languages & Literatures": "An academic department focused on the languages, literatures, and cultures of the Slavic world.",
      "Spanish & Portuguese": "An academic department committed to excellence in scholarship, innovation, diversity, and transformative learning in the languages and cultures of the Spanish- and Portuguese-speaking worlds.",
      "Spurlock Museum": "A museum of world cultures whose mission is to create space for people to learn, collaborate, and build connections by caring for and sharing cultural collections from across the globe.",
      "Translation and Interpreting Studies": "An academic program focused on the theory and practice of translation and interpretation across languages.",
      "Writing Studies": "An interdisciplinary academic unit with a linked mission to support a Writing Across the Curriculum (WAC) program, provide support to all campus writers via the Writers Workshop, and sustain a community of writing studies scholars."
    },
    "Chemical sciences": {
      "Biochemistry": "A department within the School of MCB focused on discovering the fundamental principles supporting life.",
      "Chemical & Biomolecular Engineering": "The study and application of chemical engineering principles to molecular-level problems, including biotechnology and materials.",
      "Chemical Sciences": "An administrative unit comprising the departments of Chemistry and Chemical & Biomolecular Engineering.",
      "Chemistry": "A department dedicated to advancing the instructional mission of chemistry, connecting instructors and students with technology, and advocating for women and younger chemists in the chemical sciences."
    },
    "Humanities": {
      "African American Studies": "An academic department with a central mission to enrich lives and transform society by creating new knowledge and exploring the interconnections among African Americans and other racialized communities.",
      "American Indian Studies": "An academic program dedicated to the study of the histories, cultures, languages, and contemporary experiences of Indigenous peoples of the Americas.",
      "Anthropology": "The interdisciplinary study of humanity, fusing archaeological evidence, historical texts, and ethnographic methods to understand peoples and cultures from the past to the present.",
      "Asian American Studies": "An interdisciplinary department that stimulates and promotes research and challenging courses to explore the history, culture, and experiences of Asian Americans.",
      "Classics": "An academic department that fosters inquiry into the languages, literatures, art, archaeology, histories, and philosophical traditions of ancient Greece and Rome and neighboring Mediterranean areas.",
      "Communication": "An academic department exploring human communication in various contexts, including mass media, race, and interpersonal relations.",
      "Comparative & World Literature": "An academic program dedicated to the study of literature across national, linguistic, and cultural boundaries.",
      "Criticism & Interpretive Theory": "An interdisciplinary unit that fosters the study of critical theory and its application in the humanities and social sciences.",
      "East Asian Languages & Cultures": "An academic department focused on the languages, literatures, histories, and cultures of China, Japan, and Korea.",
      "English": "An academic department focused on the study of literature, writing, and environmental and scientific history.",
      "Foreign Language Teacher Education Program": "An academic program dedicated to preparing students to become licensed teachers of foreign languages.",
      "French & Italian": "An academic department dedicated to enhancing undergraduate and graduate education in the languages, literatures, and cultures of the French- and Italian-speaking worlds.",
      "Gender & Women's Studies": "An interdisciplinary department that studies the politics of dress, labor, and self-representation, focusing on gender, race, nation, and sexuality as critical factors.",
      "Germanic Languages & Literatures": "An academic department focused on the languages, literatures, and cultures of the Germanic-speaking world.",
      "History": "An academic department with a mission to support students in meeting their academic and professional goals through the study of the past.",
      "Jewish Culture & Society": "An academic program that provides insights into Judaism, Israel, and the Jewish experience by fusing archaeological evidence, historical texts, and Semitic inscriptions.",
      "Latina/Latino Studies": "An interdisciplinary department exploring the U.S. Latina/Latino experience from a sociological, historical, and cultural perspective, focusing on class, gender, sexuality, and race.",
      "Linguistics": "The scientific study of human language, including its structure, use, and cognitive basis.",
      "Literatures, Cultures & Linguistics": "An academic unit with a mission of 'transforming lives and serving society by educating, creating knowledge, and putting knowledge to work' across diverse languages and cultures.",
      "Medieval Studies": "An academic program with a mission to foster the interdisciplinary and collaborative study of the histories, literatures, languages, beliefs, ideas, arts, and archaeologies of the medieval globe.",
      "Philosophy": "The academic discipline that studies fundamental questions about existence, knowledge, values, reason, mind, and language.",
      "Religion": "An academic department for the study of religion, providing various fields of concentration and exploring its historical and constitutional role.",
      "Slavic Languages & Literatures": "An academic department focused on the languages, literatures, and cultures of the Slavic world.",
      "Sociology": "An academic department with a mission to enhance undergraduate and graduate education by granting scholarships, recruiting scholars, and hosting conferences.",
      "Spanish & Portuguese": "An academic department committed to excellence in scholarship, innovation, diversity, and transformative learning in the languages and cultures of the Spanish- and Portuguese-speaking worlds.",
      "Writing Studies": "An interdisciplinary academic unit with a linked mission to support a Writing Across the Curriculum (WAC) program, provide support to all campus writers via the Writers Workshop, and sustain a community of writing studies scholars."
    },
    "Interdisciplinary research": {
      "African Studies": "An academic center with an educational mission to bring together faculty and students with a common interest in Africa, providing a rich environment for research and training.",
      "Advanced Social Research": "A research center with a mission of transforming information into knowledge that advances human flourishing through research, education, collaboration, and outreach.",
      "Criticism & Interpretive Theory": "An interdisciplinary unit that fosters the study of critical theory and its application in the humanities and social sciences.",
      "East Asian & Pacific Studies": "An academic center promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
      "European Union Studies": "An academic center focused on the study of the European Union, its institutions, and its role in global issues like energy and policy.",
      "Global Studies": "An academic center with a mission to promote and support innovative research to better understand global issues, emphasizing advanced language skills and developing expertise in areas like Global Health and Governance.",
      "Illinois Global Institute": "An institute that fosters collaboration on global and regional questions, bringing together various area studies centers with a shared commitment to international research.",
      "Latin American & Caribbean Studies": "An academic center with a mission to increase knowledge and awareness of Latin America and the Caribbean by promoting innovative research, specialist teaching, and public engagement.",
      "Brazilian Studies": "An academic center that fosters research and understanding of Brazilian society, politics, and culture, supporting graduate fellows in their research.",
      "Russian, East European, and Eurasian Studies": "An academic center dedicated to the interdisciplinary study of the languages, cultures, and societies of Russia, Eastern Europe, and Eurasia.",
      "South Asian & Middle Eastern Studies": "An academic center that promotes scholarship, teaching, and public engagement on two regions of global significance, with a mission to 'demystify' the regions and deconstruct stereotypes.",
      "Spurlock Museum": "A museum of world cultures whose mission is to create space for people to learn, collaborate, and build connections by caring for and sharing cultural collections from across the globe.",
      "Study of Global Gender Equity": "An academic center with a mission to promote gender equity and human development by addressing resource inequalities through a multi-disciplinary approach, with a historic focus on the Global South.",
      "Writing Studies": "An interdisciplinary academic unit with a linked mission to support a Writing Across the Curriculum (WAC) program, provide support to all campus writers via the Writers Workshop, and sustain a community of writing studies scholars."
    },
    "International and area studies": {
      "Arms Control & Domestic and International Security": "An interdisciplinary venture that facilitates objective research, academics, and outreach about international security issues within the academic and policymaking communities.",
      "African Studies": "An academic center with an educational mission to bring together faculty and students with a common interest in Africa, providing a rich environment for research and training.",
      "East Asian & Pacific Studies": "An academic center promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
      "European Union Studies": "An academic center focused on the study of the European Union, its institutions, and its role in global issues like energy and policy.",
      "Global Studies": "An academic center with a mission to promote and support innovative research to better understand global issues, emphasizing advanced language skills and developing expertise in areas like Global Health and Governance.",
      "Global Studies, LAS": "An academic program offering interdisciplinary study of global issues, cultures, and languages.",
      "Illinois Global Institute": "An institute that fosters collaboration on global and regional questions, bringing together various area studies centers with a shared commitment to international research.",
      "Latin American & Caribbean Studies": "An academic center with a mission to increase knowledge and awareness of Latin America and the Caribbean by promoting innovative research, specialist teaching, and public engagement.",
      "Brazilian Studies": "An academic center that fosters research and understanding of Brazilian society, politics, and culture, supporting graduate fellows in their research.",
      "Russian, East European, and Eurasian Studies": "An academic center dedicated to the interdisciplinary study of the languages, cultures, and societies of Russia, Eastern Europe, and Eurasia.",
      "South Asian & Middle Eastern Studies": "An academic center that promotes scholarship, teaching, and public engagement on two regions of global significance, with a mission to 'demystify' the regions and deconstruct stereotypes.",
      "Study of Global Gender Equity": "An academic center with a mission to promote gender equity and human development by addressing resource inequalities through a multi-disciplinary approach, with a historic focus on the Global South."
    },
    "Mathematical sciences": {
      "Mathematics": "An academic department with a mission to expand access to top-tier mathematics education and stand on the frontier of groundbreaking mathematical research.",
      "Statistics": "An academic department that applies rigorous mathematics and statistics to urgent, complex scientific and societal problems."
    },
    "Physical sciences": {
      "Astronomy": "An academic department that provides a 'roadmap' for astronomical research, marrying astronomy and AI to investigate the cosmos, from the Far IR to dark matter.",
      "Atmospheric Sciences": "An academic department focused on research and teaching to communicate the issues of climate change and understand atmospheric phenomena like precipitation.",
      "Biophysics & Quantitative Biology": "An interdisciplinary center to train students and foster research at the interface between the physical, computational, and life sciences to elucidate the physical basis of biological phenomena.",
      "Earth, Society & Environment": "A premier academic school with a mission to provide a world-class education and bridge core disciplines to tackle the greatest earth science and environmental/social problems facing humankind.",
      "Ecology, Evolution & Conservation Biology": "An interdisciplinary program exploring life at every scale, from molecules to ecosystems, to address global change and biodiversity.",
      "Geography & Geographic Information Science": "An academic department whose central mission is to enhance global well-being through the geospatial, natural, and social sciences in an environment free from prejudice.",
      "Earth Science & Environmental Change": "An academic department whose mission centers on the apprenticeship-style graduate education and research in applied geoscience, including hydrogeology, geophysics, and volcanology."
    },
    "Race, ethnicity, indigeneity, and gender": {
      "African American Studies": "An academic department with a central mission to enrich lives and transform society by creating new knowledge and exploring the interconnections among African Americans and other racialized communities.",
      "American Indian Studies": "An academic program dedicated to the study of the histories, cultures, languages, and contemporary experiences of Indigenous peoples of the Americas.",
      "Asian American Studies": "An interdisciplinary department that stimulates and promotes research and challenging courses to explore the history, culture, and experiences of Asian Americans.",
      "Gender & Women's Studies": "An interdisciplinary department that studies the politics of dress, labor, and self-representation, focusing on gender, race, nation, and sexuality as critical factors.",
      "Illinois Global Institute": "An institute that fosters collaboration on global and regional questions, bringing together various area studies centers with a shared commitment to international research.",
      "Latina/Latino Studies": "An interdisciplinary department exploring the U.S. Latina/Latino experience from a sociological, historical, and cultural perspective, focusing on class, gender, sexuality, and race.",
      "Study of Global Gender Equity": "An academic center with a mission to promote gender equity and human development by addressing resource inequalities through a multi-disciplinary approach, with a historic focus on the Global South."
    },
    "Social and behavioral sciences": {
      "African American Studies": "An academic department with a central mission to enrich lives and transform society by creating new knowledge and exploring the interconnections among African Americans and other racialized communities.",
      "American Indian Studies": "An academic program dedicated to the study of the histories, cultures, languages, and contemporary experiences of Indigenous peoples of the Americas.",
      "Anthropology": "The interdisciplinary study of humanity, fusing archaeological evidence, historical texts, and ethnographic methods to understand peoples and cultures from the past to the present.",
      "Asian American Studies": "An interdisciplinary department that stimulates and promotes research and challenging courses to explore the history, culture, and experiences of Asian Americans.",
      "Advanced Social Research": "A research center with a mission of transforming information into knowledge that advances human flourishing through research, education, collaboration, and outreach.",
      "Communication": "An academic department exploring human communication in various contexts, including mass media, race, and interpersonal relations.",
      "Economics": "The academic discipline that studies the production, distribution, and consumption of goods and services, and the models of economic behavior at individual and aggregate levels.",
      "Gender & Women's Studies": "An interdisciplinary department that studies the politics of dress, labor, and self-representation, focusing on gender, race, nation, and sexuality as critical factors.",
      "Geography & Geographic Information Science": "An academic department whose central mission is to enhance global well-being through the geospatial, natural, and social sciences in an environment free from prejudice.",
      "Global Studies, LAS": "An academic program offering interdisciplinary study of global issues, cultures, and languages.",
      "Illinois in Washington Program": "An academic program that provides students with valuable internship experiences in Washington D.C., helping them grow personally and professionally in public policy and civic affairs.",
      "Latina/Latino Studies": "An interdisciplinary department exploring the U.S. Latina/Latino experience from a sociological, historical, and cultural perspective, focusing on class, gender, sexuality, and race.",
      "Linguistics": "The scientific study of human language, including its structure, use, and cognitive basis.",
      "Neuroscience Program": "An interdisciplinary program that fosters research and education at the intersection of multiple colleges to understand the brain and nervous system.",
      "Political Science": "An academic department that prepares students for leadership positions in civic affairs through coursework in American politics, public policy, and civic engagement.",
      "Psychology": "The scientific study of the mind and behavior, from its biological basis to its social and cognitive processes.",
      "Sociology": "An academic department with a mission to enhance undergraduate and graduate education by granting scholarships, recruiting scholars, and hosting conferences."
    }
  },
  "College of Agricultural, Consumer & Environmental Sciences (ACES)": {
    "Agricultural & Consumer Economics": {
      "Agribusiness Management": "The application of business principles to the operation and management of farms and agribusinesses.",
      "Development Economics": "The study of economic challenges in developing countries, with a focus on agriculture, poverty, and food security.",
      "Environmental & Resource Economics": "The economic study of natural resource management and environmental policies, including climate and energy issues.",
      "Finance & Risk Management": "The study of financial markets and risk management strategies within the agricultural and food sectors.",
      "Public Policy & Law": "The analysis of government policies, laws, and regulations affecting agriculture, food, and the environment."
    },
    "Animal Sciences": {
      "Animal Behavior & Welfare": "The study of animal behavior and the promotion of animal health and well-being through proper management and housing.",
      "Genetics, Genomics & Bioinformatics": "The application of genetic and computational tools to improve livestock health, productivity, and sustainability.",
      "Microbiology": "The study of microorganisms in animal systems, particularly gut health and its impact on nutrition and disease.",
      "Nutrition & Metabolism": "The study of the nutritional requirements of animals and the biochemical processes of nutrient utilization.",
      "Physiology": "The study of the biological functions of animals, including reproduction, lactation, and growth."
    },
    "Crop Sciences": {
      "Agronomy & Agroecology": "The study of crop production, soil management, and the ecological principles of sustainable agricultural systems.",
      "Bioinformatics & Statistics": "The use of computational and statistical methods to analyze genomic data for crop improvement.",
      "Horticulture": "The science and art of cultivating specialty crops such as fruits, vegetables, and ornamental plants.",
      "Plant Breeding & Genetics": "The science of improving the genetic makeup of plants for desirable traits like yield, quality, and disease resistance.",
      "Plant Pathology & Weed Science": "The study of plant diseases and weeds, and the development of integrated management strategies."
    },
    "Food Science & Human Nutrition": {
      "Food Chemistry & Processing": "The study of the chemical composition of foods and the engineering principles behind food processing and preservation.",
      "Food Microbiology & Safety": "The study of microorganisms in food, focusing on foodborne pathogens, fermentation, and food safety practices.",
      "Human Nutrition & Metabolism": "The study of how nutrients and diet affect human health, metabolism, and the prevention of chronic diseases.",
      "Sensory Science": "The scientific discipline used to evoke, measure, analyze, and interpret human reactions to products as perceived through the senses."
    },
    "Natural Resources & Environmental Sciences": {
      "Conservation Biology & Ecology": "The study of biodiversity, population dynamics, and the principles for conserving species and ecosystems.",
      "Environmental Science & Management": "The interdisciplinary study of soil, water, and ecosystems, and their management for environmental quality.",
      "Fisheries & Wildlife Science": "The study of the ecology, management, and conservation of fish and wildlife populations and their habitats."
    }
  },
  "Gies College of Business": {
    "Accountancy": {
      "Auditing & Assurance": "The examination of financial records to ensure fairness and accuracy, providing confidence to stakeholders.",
      "Financial Accounting": "The process of recording, summarizing, and reporting a company's business transactions through financial statements.",
      "Managerial Accounting": "The use of accounting information to help managers within an organization make decisions and manage performance.",
      "Taxation": "The study of tax law and its application to financial planning and compliance for individuals and corporations."
    },
    "Business Administration": {
      "Information Systems & Business Analytics": "The study of how organizations use information technology and data analytics to improve business processes and decision-making.",
      "Marketing": "The process of creating, communicating, and delivering value to customers and managing customer relationships.",
      "Operations Management": "The management of processes and systems that create goods or provide services.",
      "Organizational Behavior & Strategy": "The study of human behavior in organizational settings and the formulation of long-term business strategy.",
      "Supply Chain Management": "The management of the flow of goods and services from point of origin to point of consumption."
    },
    "Finance": {
      "Asset Pricing": "The study of how financial assets like stocks, bonds, and derivatives are valued in the marketplace.",
      "Corporate Finance": "The study of how corporations make financial decisions, including investment, financing, and dividend policies.",
      "Financial Intermediation": "The study of financial institutions like banks and their role in channeling funds from savers to borrowers.",
      "Real Estate": "The study of finance and investment related to real property, including housing and commercial markets."
    }
  },
  "School of Information Sciences (iSchool)": {
    "Information Sciences": {
      "Archives & Special Collections": "The theory and practice of managing and preserving records, documents, and other materials of enduring value.",
      "Data Science & Analytics": "The application of statistical, computational, and visualization techniques to extract knowledge from data.",
      "Human-Centered Design & Systems": "The interdisciplinary approach to designing interactive systems that are useful, usable, and centered on human needs.",
      "Information Organization & Access": "The study of how to describe, organize, and provide access to information resources, including digital libraries and metadata.",
      "Knowledge Management & Information Policy": "The study of how organizations manage knowledge and the societal policies and ethics governing information.",
      "Youth Services & Librarianship": "The study of literature, information literacy, and library services for children and young adults."
    }
  },
  "College of Education": {
    "Curriculum & Instruction": {
      "Bilingual & ESL Education": "The study of teaching and learning for students who are bilingual or learning English as a second language.",
      "Digital Learning": "The study and design of learning experiences that are enhanced by digital technologies.",
      "Literacy Studies": "The study of reading, writing, and literacy practices across different contexts and media.",
      "STEM Education": "The study of teaching and learning in Science, Technology, Engineering, and Mathematics."
    },
    "Education Policy, Organization & Leadership": {
      "Educational Policy Studies": "The analysis of educational policies and their political, economic, and historical contexts.",
      "Higher Education": "The study of the administration, policies, and student development within colleges and universities.",
      "Human Resource Development": "The study of workplace learning, training, and organizational development to improve performance."
    },
    "Educational Psychology": {
      "Cognitive Science of Teaching & Learning": "The interdisciplinary study of the mind and its processes as they relate to learning and instruction.",
      "Counseling Psychology": "The study and practice of promoting mental health and well-being across the lifespan.",
      "Developmental Sciences": "The study of human cognitive, social, and emotional development across the lifespan.",
      "Quantitative & Evaluative Methods": "The application of statistical methods, measurement theory, and evaluation design to educational research."
    },
    "Special Education": {
      "Autism & Developmental Disabilities": "The study of and development of interventions for individuals with autism spectrum disorder and other developmental disabilities.",
      "Inclusive Education": "The study and practice of educating students with disabilities in general education settings.",
      "Learning Disabilities": "The study of the causes and characteristics of learning disabilities and evidence-based instructional practices."
    }
  },
  "College of Law": {
    "Legal Studies": {
      "Business & Commercial Law": "The body of law that governs business and commercial transactions, including corporate and bankruptcy law.",
      "Constitutional & Public Law": "The study of the law that structures government and defines the rights of citizens, including administrative and election law.",
      "Criminal Law & Procedure": "The study of the law defining criminal offenses and the legal procedures for adjudicating criminal cases.",
      "Intellectual Property & Technology Law": "The law governing creations of the mind, such as patents, copyrights, and trademarks, as well as technology-related legal issues.",
      "International & Comparative Law": "The study of the law governing relations between nations and the comparison of legal systems across different countries.",
      "Taxation & Employee Benefits": "The body of law governing governmental levies (taxes) and the regulation of employee benefit plans."
    }
  },
  "College of Applied Health Sciences": {
    "Kinesiology & Community Health": {
      "Biomechanics": "The study of the mechanics of biological systems and human movement.",
      "Community Health": "The science of protecting and improving the health of people and their communities.",
      "Exercise Physiology": "The study of the body's response and adaptation to physical activity and exercise.",
      "Kinesiology": "The comprehensive study of human movement, encompassing motor control, psychology, and adapted physical activity."
    },
    "Speech & Hearing Science": {
      "Audiology": "The science of hearing, balance, and their associated disorders, including the provision of hearing aids.",
      "Language Science": "The interdisciplinary study of language development, psycholinguistics, and bilingualism.",
      "Neuroscience of Communication": "The study of the neural bases of speech, language, and hearing, and neurogenic communication disorders.",
      "Speech-Language Pathology": "The assessment and treatment of communication and swallowing disorders."
    }
  },
  "College of Fine & Applied Arts": {
    "Architecture": {
      "Architectural History & Theory": "The study of the historical evolution and theoretical principles of architectural design.",
      "Building Performance": "The science of designing buildings for energy efficiency, structural integrity, and sustainability.",
      "Design & Urbanism": "The study of architectural design at the scale of buildings and their relationship to the urban environment.",
      "Health & Well-being": "The design of built environments that promote human health, wellness, and quality of life."
    },
    "Landscape Architecture": {
      "Cultural Heritage": "The study and preservation of landscapes with significant cultural and historical value.",
      "Ecological Design": "The design of landscapes that are integrated with ecological processes, such as stormwater management and restoration.",
      "Social & Environmental Justice": "The practice of landscape architecture to address issues of equity, community engagement, and environmental justice."
    },
    "Urban & Regional Planning": {
      "Community Development": "The planning of housing, economic opportunities, and social policies to improve community well-being.",
      "Environmental Planning": "The process of planning land use and development to protect environmental quality and promote sustainability.",
      "Transportation Planning": "The design and analysis of transportation systems to ensure efficient and equitable mobility."
    }
  }
}