{
  "The Grainger College of Engineering": {
    "Computer Science": {
      "Algorithms & Theory of Computation": {
        "Analysis of Algorithms": "The determination of the computational resources (like time and memory) required by an algorithm to solve a problem.",
        "Complexity Theory": "The classification of computational problems according to their inherent difficulty and the relationships between those classes.",
        "Cryptography": "The study and practice of techniques for secure communication in the presence of adversaries, focusing on confidentiality and integrity.",
        "Algorithmic Game Theory": "The study of the intersection of computer science and game theory, focusing on algorithms for strategic interactions.",
        "Randomized Algorithms": "The use of randomness as a tool for algorithm design, often leading to simpler or more efficient solutions."
      },
      "Artificial Intelligence & Machine Learning": {
        "Learning Theory": "The mathematical study of the principles underlying machine learning algorithms and their performance.",
        "Deep Learning & Neural Networks": "A class of machine learning algorithms based on artificial neural networks with many layers, enabling learning from vast amounts of data.",
        "Reinforcement Learning": "A type of machine learning where an agent learns to make decisions by taking actions in an environment to maximize cumulative reward.",
        "Probabilistic Graphical Models": "A framework for representing and reasoning about uncertainty using probability and graph theory.",
        "Knowledge Representation & Reasoning": "The field of AI dedicated to representing information about the world in a form that a computer system can utilize to solve complex tasks.",
        "Trustworthy & Ethical AI": "The study of ensuring that AI systems are fair, transparent, explainable, and aligned with human values."
      },
      "Computer Architecture & Parallel Computing": {
        "High-Performance Computing (HPC)": "The use of supercomputers and parallel processing techniques for solving complex computational problems.",
        "Processor & System-on-Chip (SoC) Design": "The design of central processing units (CPUs), graphics processing units (GPUs), and integrated systems on a single chip.",
        "Memory & Storage Systems": "The study and design of hierarchical memory systems, including caches, RAM, and long-term storage like SSDs.",
        "Parallel Programming Models": "The development of programming languages and models for effectively writing code that executes on parallel hardware.",
        "Domain-Specific Architectures": "The design of specialized computer hardware optimized for a specific application domain, such as machine learning or networking."
      },
      "Computer Vision & Graphics": {
        "Image & Video Analysis": "The techniques for processing and extracting meaningful information from digital images and video streams.",
        "3D Reconstruction & Scene Understanding": "The process of creating 3D models from images or sensor data and interpreting the geometry and semantics of a scene.",
        "Computational Photography": "The convergence of computer graphics, computer vision, and optics to overcome the limitations of traditional photography.",
        "Rendering & Animation": "The process of generating photorealistic or stylized images from 2D or 3D models and creating the illusion of motion.",
        "Visual Recognition & Detection": "The task of identifying and locating objects, faces, and activities within images and videos."
      },
      "Databases & Information Systems": {
        "Data Mining & Knowledge Discovery": "The process of discovering patterns, anomalies, and insights from large datasets.",
        "Database System Internals": "The study of the underlying principles of how database management systems (DBMS) are built, including storage, indexing, and query processing.",
        "Information Retrieval": "The science of searching for information in documents, searching for documents themselves, and searching for metadata which describe data.",
        "Large-Scale Data Analytics": "The design of systems and algorithms for processing and analyzing massive datasets that do not fit into single-machine memory.",
        "Data Curation & Provenance": "The active management of data throughout its lifecycle to ensure its quality, and the tracking of its origin and transformations."
      },
      "Human-Computer Interaction (HCI)": {
        "User Interface (UI) & User Experience (UX) Design": "The design of the visual and interactive elements of a system and the overall experience a person has when using it.",
        "Ubiquitous & Mobile Computing": "The paradigm of embedding computational capabilities into everyday objects and environments, accessible via mobile devices.",
        "Social Computing": "The study of how people interact with computational systems in social contexts, including social media and collaborative tools.",
        "Accessibility & Assistive Technology": "The design of technology and systems to be usable by people with a wide range of disabilities.",
        "Visualization & Visual Analytics": "The creation of interactive visual representations of data to amplify human cognition and facilitate discovery."
      },
      "Natural Language Processing (NLP)": {
        "Machine Translation": "The task of automatically translating text or speech from one language to another.",
        "Information Extraction & Text Mining": "The process of automatically extracting structured information from unstructured text documents.",
        "Dialogue & Interactive Systems": "The design of conversational agents (chatbots, voice assistants) that can interact with humans in natural language.",
        "Computational Social Science": "The use of computational methods, especially NLP, to analyze large-scale social data and understand social phenomena.",
        "Language Grounding & Multimodality": "The study of connecting language to other modalities, such as vision and action, to create a deeper understanding of meaning."
      },
      "Programming Languages & Software Engineering": {
        "Compilers & Runtimes": "The design of software that translates high-level programming code into machine code and manages its execution.",
        "Formal Methods & Verification": "The use of mathematical techniques to specify, develop, and formally prove the correctness of software and hardware systems.",
        "Software Testing & Analysis": "The development of methods for finding and fixing errors in software through automated testing and program analysis.",
        "Programming Language Design": "The theory and practice of creating new programming languages with specific features for clarity, performance, or safety.",
        "Empirical Software Engineering": "The study of software development processes and products through empirical data collection and analysis."
      },
      "Scientific Computing & Numerical Methods": {
        "Numerical Linear Algebra": "The study of algorithms for performing matrix computations, which are fundamental to scientific simulation.",
        "Differential Equation Solvers": "The development of numerical methods for solving ordinary and partial differential equations that model physical phenomena.",
        "High-Performance Scientific Libraries": "The creation of optimized software libraries for common numerical computations used in scientific applications.",
        "Computational Science & Engineering": "An interdisciplinary field that uses computation and simulation to solve complex problems in various scientific and engineering domains.",
        "Data-Driven Scientific Discovery": "The use of machine learning and data analysis techniques to extract knowledge and hypotheses from large scientific datasets."
      },
      "Security & Privacy": {
        "Network & Distributed System Security": "The protection of data and services in networked environments, including defending against attacks like denial-of-service.",
        "Cryptography & Cryptanalysis": "The design of cryptographic protocols and the analysis of their strength against adversarial attacks.",
        "Software & Systems Security": "The identification and mitigation of vulnerabilities in software code and operating systems.",
        "Privacy-Enhancing Technologies": "The development of technologies that enable online activities without compromising user privacy, such as anonymity systems and differential privacy.",
        "Hardware Security": "The protection of the physical hardware components of a computing system from malicious attacks."
      },
      "Systems & Networking": {
        "Operating Systems": "The study of the core software that manages computer hardware, resources, and provides common services for computer programs.",
        "Distributed Systems & Cloud Computing": "The study of systems whose components are located on different networked computers, and the delivery of computing services over the internet.",
        "Computer Networks": "The principles and protocols that govern how data is transmitted and routed between computers, including the internet.",
        "Wireless & Mobile Systems": "The study of wireless communication technologies and the design of systems for mobile devices like smartphones.",
        "Systems for Machine Learning": "The design of specialized computer systems and software infrastructure to support large-scale machine learning training and inference."
      }
    },
    "Electrical & Computer Engineering": {
      "Circuits & VLSI Design": {
        "Analog & Mixed-Signal Circuits": "The design of circuits that process continuous analog signals and interface between the analog and digital domains.",
        "Digital & Memory Circuits": "The design of circuits that perform logic operations using discrete values and the architecture of computer memory.",
        "RF & Millimeter-Wave Circuits": "The design of high-frequency circuits for wireless communication applications, such as in 5G and radar.",
        "Power Management Circuits": "The design of circuits that efficiently manage and convert electrical power in electronic devices.",
        "CAD & Design Automation": "The development of computer-aided design (CAD) tools to automate the design and verification of complex integrated circuits."
      },
      "Communications": {
        "Wireless Communication & Networks": "The study of technologies like Wi-Fi, 5G/6G, and satellite communications for untethered information transfer.",
        "Information Theory & Coding": "The mathematical study of the fundamental limits of data compression and reliable communication.",
        "Optical Communication": "The use of light, typically through fiber optics, to transmit information over long distances at high data rates.",
        "Network Science & Theory": "The study of complex networks, such as the internet and social networks, using tools from graph theory and statistical physics."
      },
      "Control Systems": {
        "Linear & Nonlinear Control": "The design of controllers for systems described by linear and nonlinear mathematical models.",
        "Optimal & Stochastic Control": "The design of controllers that optimize a specific performance criterion, often in the presence of randomness.",
        "Networked Control Systems": "The study of control systems where sensors, actuators, and controllers are interconnected over a communication network.",
        "Control of Autonomous Systems": "The application of control theory to enable autonomous operation of systems like self-driving cars and drones."
      },
      "Electromagnetics & Photonics": {
        "Antennas & Propagation": "The design of antennas for transmitting and receiving radio waves and the study of how those waves travel through different media.",
        "Computational Electromagnetics": "The development of numerical methods to simulate and solve complex electromagnetic problems.",
        "Integrated Photonics & Optoelectronics": "The design of optical devices and systems on a chip, analogous to integrated electronic circuits.",
        "Optical Imaging & Spectroscopy": "The use of light to form images of objects and to measure their properties by analyzing their interaction with light.",
        "Plasmonics & Metamaterials": "The study of engineered materials with exotic optical properties and the manipulation of light at the nanoscale."
      },
      "Microelectronics & Nanotechnology": {
        "Semiconductor Devices & Physics": "The study of the physics of semiconductor materials and the design of electronic devices like transistors and diodes.",
        "Micro-Electro-Mechanical Systems (MEMS)": "The technology of microscopic devices, particularly those with moving parts, such as sensors and actuators.",
        "Nanofabrication & Nanomaterials": "The techniques for creating structures at the nanometer scale and the study of materials with novel nanoscale properties.",
        "Quantum Devices": "The design and fabrication of electronic devices that exploit quantum mechanical effects for new functionalities."
      },
      "Power & Energy Systems": {
        "Power Electronics & Motor Drives": "The use of solid-state electronics to control and convert electric power, essential for electric vehicles and renewable energy.",
        "Smart Grids & Grid Integration": "The modernization of the electrical grid using information technology to improve reliability, efficiency, and integrate renewable sources.",
        "Renewable Energy Systems": "The engineering of systems for harnessing energy from sources like solar, wind, and geothermal.",
        "Power System Dynamics & Control": "The analysis and control of the stability of large-scale electrical power grids."
      },
      "Quantum Information Science": {
        "Quantum Computing": "The use of quantum-mechanical phenomena such as superposition and entanglement to perform computation.",
        "Quantum Communication & Cryptography": "The use of quantum principles to enable secure communication channels that are provably immune to eavesdropping.",
        "Quantum Sensing & Metrology": "The use of quantum systems to make ultra-precise measurements of physical quantities.",
        "Quantum Simulation": "The use of controllable quantum systems to simulate the behavior of other, more complex quantum systems."
      },
      "Robotics & Autonomous Systems": {
        "Control Theory for Robotics": "The application of control systems theory to govern the movement and behavior of robots.",
        "Motion Planning & Kinematics": "The study of algorithms for planning collision-free paths for robots and the mathematics of robot motion.",
        "Perception & Sensor Fusion": "The process by which robots interpret data from sensors (like cameras and lidar) to understand their environment.",
        "Human-Robot Interaction": "The study of how humans and robots can interact and collaborate safely and effectively.",
        "Multi-Agent & Swarm Robotics": "The coordination of large groups of simple robots to perform complex tasks collectively."
      },
      "Signal & Image Processing": {
        "Biomedical Imaging & Image Analysis": "The processing of medical images (like MRI, CT scans) to enhance their quality and extract clinical information.",
        "Machine Learning for Signal Processing": "The application of machine learning and deep learning techniques to analyze and classify signals and images.",
        "Audio & Speech Processing": "The analysis and synthesis of audio signals, including speech recognition, speaker identification, and audio enhancement.",
        "Statistical Signal Processing": "The use of statistical models to represent and analyze signals and to make inferences from noisy data."
      }
    },
    "Mechanical Science & Engineering": {
      "Biomechanics & Mechanobiology": {
        "Cellular & Tissue Mechanics": "The study of how mechanical forces affect the behavior and function of cells and biological tissues.",
        "Musculoskeletal Biomechanics": "The analysis of the mechanics of bones, muscles, ligaments, and joints during human movement.",
        "Bio-inspired Design": "The development of engineering solutions inspired by the designs and processes found in nature.",
        "Cardiovascular Biomechanics": "The study of the mechanics of the heart, blood vessels, and blood flow."
      },
      "Controls & Dynamics": {
        "Vibrations & Acoustics": "The study of mechanical oscillations and the science of sound and its control.",
        "Nonlinear Dynamics & Chaos": "The study of systems whose behavior is not proportional to their inputs, often leading to complex and unpredictable dynamics.",
        "Mechatronics & Embedded Systems": "The integration of mechanical engineering with electronics and computer control in the design of products and systems.",
        "Vehicle Dynamics & Control": "The study of the motion of vehicles (ground, air, and sea) and the design of systems to control their movement."
      },
      "Design & Manufacturing": {
        "Additive Manufacturing (3D Printing)": "The process of building three-dimensional objects from a digital file by adding material layer by layer.",
        "Product Design & Optimization": "The use of engineering principles and computational tools to create and improve products and systems.",
        "Advanced Manufacturing Processes": "The development of novel manufacturing techniques, such as laser machining and micro-fabrication.",
        "Digital Manufacturing & Automation": "The use of computer-controlled systems and robotics to automate manufacturing processes."
      },
      "Fluid Mechanics & Thermal Sciences": {
        "Turbulence & Complex Flows": "The study of chaotic and unpredictable fluid motion, a key challenge in fluid dynamics.",
        "Heat & Mass Transfer": "The study of the movement of thermal energy and chemical species within and between systems.",
        "Combustion & Propulsion": "The science of chemical reactions that produce heat and light, and its application in engines and propulsion systems.",
        "Multiphase Flow": "The study of the simultaneous flow of materials with different states or phases, such as gas-liquid or solid-fluid flows.",
        "Energy Conversion & Storage": "The engineering of systems to convert energy from one form to another and to store it efficiently."
      },
      "Solid Mechanics & Materials": {
        "Continuum Mechanics": "The modeling of the behavior of materials as a continuous mass rather than as discrete particles.",
        "Fracture & Fatigue": "The study of how and why materials break under static and cyclic loading.",
        "Computational Mechanics": "The use of numerical methods, such as the finite element method, to simulate the behavior of materials and structures.",
        "Mechanics of Materials": "The study of the relationship between the internal stresses and strains in a solid body under various loading conditions.",
        "Geomechanics": "The study of the mechanical behavior of geological materials like soil and rock."
      }
    },
    "Civil & Environmental Engineering": {
      "Construction Engineering & Management": {
        "Project Management & Control": "The methodologies for planning, scheduling, budgeting, and controlling construction projects.",
        "Construction Informatics": "The application of information technology and data science to improve construction processes.",
        "Automation in Construction": "The use of robotics and automated systems to perform construction tasks.",
        "Construction Safety": "The study and implementation of practices to prevent accidents and injuries on construction sites."
      },
      "Environmental Engineering & Science": {
        "Water Quality & Treatment": "The science of assessing water quality and designing systems for drinking water purification and wastewater treatment.",
        "Air Quality & Pollution Control": "The study of air pollutants and the development of technologies to control their emission.",
        "Environmental Biotechnology": "The use of biological systems, like microbes, for environmental remediation and waste treatment.",
        "Sustainable Engineering": "The design of engineering systems that meet human needs while minimizing environmental impact."
      },
      "Geotechnical Engineering": {
        "Soil Mechanics & Foundations": "The study of the physical properties of soil and the design of foundations for structures.",
        "Rock Mechanics": "The study of the mechanical behavior of rock and its response to applied forces, relevant to tunneling and mining.",
        "Earthquake Engineering": "The design of structures and systems to resist the forces generated by earthquakes.",
        "Geoenvironmental Engineering": "The application of geotechnical principles to solve environmental problems, such as landfill design and contaminant transport."
      },
      "Structural Engineering & Materials": {
        "Structural Dynamics & Earthquake Engineering": "The study of the behavior of structures subjected to dynamic loads like wind and earthquakes.",
        "Computational Mechanics & Simulation": "The use of computer models to simulate and analyze the behavior of complex structures.",
        "Concrete & Steel Structures": "The design and analysis of structures made from the most common construction materials.",
        "Structural Health Monitoring": "The use of sensors and data analysis to continuously assess the condition and safety of structures."
      },
      "Sustainable & Resilient Infrastructure": {
        "Infrastructure Systems Analysis": "The modeling and analysis of large-scale, interconnected infrastructure networks like power grids and transportation systems.",
        "Climate Change Adaptation": "The design of infrastructure to be resilient to the impacts of climate change, such as sea-level rise and extreme weather.",
        "Risk & Reliability Analysis": "The quantification of the risk of failure and the reliability of infrastructure systems under uncertainty.",
        "Smart Cities": "The integration of information and communication technology (ICT) to manage a city's assets and improve urban services."
      },
      "Transportation Engineering": {
        "Traffic Flow Theory & Operations": "The mathematical study of traffic and the development of strategies to manage and optimize traffic flow.",
        "Transportation Systems & Planning": "The planning and design of transportation networks to meet societal needs for mobility.",
        "Pavement & Materials Engineering": "The design and analysis of roadway pavements and the materials used in their construction.",
        "Railroad & Public Transit Engineering": "The engineering and planning of railway systems and public transportation networks."
      },
      "Water Resources Engineering": {
        "Hydrology & Hydraulic Engineering": "The study of the movement, distribution, and quality of water on Earth, and the engineering of water flow in pipes and channels.",
        "Groundwater & Subsurface Flow": "The study of the flow of water beneath the Earth's surface in aquifers.",
        "Water Resources Management & Policy": "The planning and management of water resources to balance competing demands from society and the environment.",
        "Ecohydrology": "The study of the interactions between water and ecosystems."
      }
    },
    "Materials Science & Engineering": {
      "Biomaterials & Biomedical Devices": {
        "Tissue Engineering Scaffolds": "The design of porous materials that support cell growth and guide the formation of new biological tissue.",
        "Drug Delivery Systems": "The engineering of materials to control the release of therapeutic agents to specific targets in the body.",
        "Medical Implants & Devices": "The development of biocompatible materials for implants like artificial joints, stents, and dental implants.",
        "Regenerative Medicine": "An interdisciplinary field that develops methods to regrow, repair or replace damaged or diseased cells, organs or tissues."
      },
      "Ceramics & Glasses": {
        "Structural Ceramics": "The development of ceramic materials for applications requiring high strength and temperature resistance.",
        "Electroceramics": "The study of ceramic materials with specific electrical properties, used in capacitors, sensors, and actuators.",
        "Glass Science": "The study of the formation, structure, and properties of non-crystalline amorphous solids.",
        "High-Temperature Materials": "The design of materials that can withstand extreme temperatures, such as in jet engines and furnaces."
      },
      "Computational Materials Science": {
        "Molecular Dynamics Simulation": "A computer simulation method for analyzing the physical movements of atoms and molecules.",
        "Density Functional Theory (DFT)": "A quantum mechanical modeling method used to investigate the electronic structure of many-body systems.",
        "Phase-Field Modeling": "A computational method for simulating the evolution of microstructures in materials, such as crystal growth.",
        "Materials Informatics & Data Science": "The use of data-driven approaches and machine learning to accelerate the discovery and design of new materials."
      },
      "Electronic Materials & Photonics": {
        "Semiconductors": "The study of materials with electrical conductivity between that of a conductor and an insulator, forming the basis of all modern electronics.",
        "Photovoltaics & Solar Cells": "The development of materials and devices that convert sunlight directly into electricity.",
        "Thermoelectrics": "The study of materials that can convert heat into electricity and vice versa.",
        "Dielectrics & Ferroelectrics": "The study of insulating materials and those with a spontaneous electric polarization, used in capacitors and memory."
      },
      "Metals & Alloys": {
        "Physical Metallurgy": "The study of the physical and mechanical properties of metals as affected by their composition, processing, and microstructure.",
        "Mechanical Behavior of Metals": "The analysis of how metals deform and fail under applied forces.",
        "Corrosion & Degradation": "The study of the gradual destruction of materials by chemical or electrochemical reaction with their environment.",
        "Advanced Steels & High-Entropy Alloys": "The design of new metal alloys with superior properties by combining multiple elements in novel compositions."
      },
      "Polymers & Soft Materials": {
        "Polymer Physics & Chemistry": "The study of the physical principles and chemical synthesis of long-chain molecules (polymers).",
        "Self-Assembling Materials": "The design of molecules and materials that spontaneously organize themselves into ordered structures.",
        "Soft Robotics": "The design of robots from highly compliant materials, similar to those found in living organisms.",
        "Composites & Blends": "The creation of new materials by combining polymers with other materials (like fibers) or by mixing different polymers."
      }
    },
    "Bioengineering": {
      "Biomedical Imaging & Sensing": {
        "Magnetic Resonance Imaging (MRI)": "An imaging technique used in radiology to form pictures of the anatomy and the physiological processes of the body.",
        "Optical Imaging & Microscopy": "The use of light and advanced microscopes to visualize biological structures and processes at high resolution.",
        "Ultrasound & Photoacoustics": "The use of sound waves and laser-generated sound to create images of tissues inside the body.",
        "Biosensors & Diagnostics": "The development of analytical devices to detect biological molecules and diagnose diseases."
      },
      "Cell & Tissue Engineering": {
        "Stem Cell Engineering": "The use of engineering principles to control the growth and differentiation of stem cells into specific cell types.",
        "Regenerative Biomaterials": "The design of materials that can stimulate the body's own repair mechanisms to regenerate tissues.",
        "Mechanobiology": "The study of how physical forces and changes in cell or tissue mechanics contribute to development, physiology, and disease.",
        "Drug & Gene Delivery": "The engineering of vehicles, such as nanoparticles, to deliver drugs or genetic material to specific cells or tissues."
      },
      "Computational & Systems Biology": {
        "Bioinformatics & Genomics": "The use of computational tools to analyze large-scale biological data, especially DNA and protein sequences.",
        "Systems Biology Modeling": "The creation of mathematical models to understand the complex interactions within biological systems.",
        "Synthetic Biology": "The design and construction of new biological parts, devices, and systems, or the re-design of existing, natural biological systems for useful purposes.",
        "Computational Neuroscience": "The use of mathematical models and theoretical analysis to understand the principles that govern the nervous system."
      },
      "Neural Engineering & Neurotechnology": {
        "Brain-Computer Interfaces": "The development of direct communication pathways between the brain and an external device.",
        "Neuroimaging": "The use of various techniques to either directly or indirectly image the structure, function, or pharmacology of the nervous system.",
        "Neural Tissue Engineering": "The application of engineering methods to promote the repair and regeneration of nervous tissue.",
        "Computational Modeling of Neural Systems": "The use of computer simulations to model the behavior of neurons and neural networks."
      }
    },
    "Aerospace Engineering": {
      "Aerodynamics & Fluid Dynamics": {
        "Computational Fluid Dynamics (CFD)": "The use of numerical analysis and data structures to analyze and solve problems that involve fluid flows.",
        "Experimental Aerodynamics": "The use of wind tunnels and other experimental facilities to study the flow of air over bodies.",
        "Hypersonics & High-Temperature Flows": "The study of flight at speeds much greater than the speed of sound, where extreme temperatures are generated.",
        "Aeroacoustics": "The study of noise generated by aerodynamic forces and fluid flow."
      },
      "Astrodynamics & Orbital Mechanics": {
        "Space Mission Design & Optimization": "The planning of trajectories and maneuvers for spacecraft to achieve mission objectives efficiently.",
        "Satellite & Spacecraft Dynamics": "The study of the motion and attitude of artificial satellites and spacecraft in orbit.",
        "Celestial Mechanics": "The branch of astronomy that deals with the motions of celestial objects."
      },
      "Control & Estimation": {
        "Guidance, Navigation & Control (GNC)": "The design of systems to control the movement of a vehicle from a starting point to a destination.",
        "Autonomous Aerospace Systems": "The development of aircraft and spacecraft that can operate without direct human control.",
        "State Estimation & Filtering": "The use of algorithms, like the Kalman filter, to estimate the state of a system from noisy sensor measurements."
      },
      "Propulsion & Combustion": {
        "Air-Breathing Propulsion": "The study of engines, such as jet engines and ramjets, that use external air for combustion.",
        "Rocket & Electric Propulsion": "The study of engines that carry their own oxidizer (rockets) or use electromagnetic fields to accelerate propellant.",
        "Combustion Science": "The fundamental study of the chemical process of burning fuel to release energy.",
        "Sustainable Aviation Fuels": "The development of renewable or waste-derived aviation fuels to reduce the environmental impact of flying."
      },
      "Structures & Materials": {
        "Aerospace Structures & Solid Mechanics": "The application of solid mechanics principles to the design of lightweight and robust aircraft and spacecraft structures.",
        "Composite Materials": "The study of materials made from two or more constituent materials with significantly different properties, such as carbon fiber.",
        "Aeroelasticity & Structural Dynamics": "The study of the interaction between aerodynamic forces and the structural flexibility of aerospace vehicles.",
        "Fatigue & Fracture": "The analysis of how aerospace structures fail over time due to cyclic loading and crack propagation."
      }
    },
    "Industrial & Enterprise Systems Engineering": {
      "Data Analytics & Decision Sciences": {
        "Statistical Learning": "The use of statistical methods as a foundation for machine learning and predictive modeling.",
        "Predictive Modeling": "The process of using data and statistical models to predict future outcomes.",
        "Prescriptive Analytics": "The area of business analytics dedicated to finding the best course of action for a given situation.",
        "Simulation": "The imitation of the operation of a real-world process or system over time, often using computer models."
      },
      "Financial Engineering": {
        "Quantitative Finance": "The use of mathematical models and large datasets to analyze financial markets and securities.",
        "Risk Management": "The identification, evaluation, and prioritization of financial risks followed by coordinated application of resources to minimize them.",
        "Algorithmic Trading": "The use of computer programs to execute trading strategies at high speeds.",
        "Stochastic Modeling": "The use of probability and stochastic processes to model the random behavior of financial markets."
      },
      "Human Factors & Ergonomics": {
        "Cognitive Engineering": "The design of systems to support human cognitive processes such as attention, memory, and decision-making.",
        "Human-Automation Interaction": "The study of how humans work with automated systems and the design of effective human-in-the-loop control.",
        "Biomechanical & Physiological Ergonomics": "The study of the physical interaction of humans with their work environment to prevent injury and improve performance.",
        "Safety Engineering": "The application of engineering principles to identify and eliminate hazards in systems and processes."
      },
      "Operations Research & Optimization": {
        "Linear & Nonlinear Programming": "Mathematical methods for finding the best outcome in a mathematical model whose requirements are represented by linear or nonlinear relationships.",
        "Integer & Combinatorial Optimization": "The optimization of problems where some of the variables are restricted to be integers, often used in scheduling and logistics.",
        "Stochastic Optimization": "Optimization methods that incorporate randomness and uncertainty in the problem formulation.",
        "Network Optimization": "The study of optimization problems on networks, such as finding the shortest path or maximum flow."
      },
      "Systems Engineering & Design": {
        "System Architecture & Modeling": "The conceptual model that defines the structure, behavior, and more views of a system.",
        "Design Theory & Methodology": "The formal study of the principles and processes that underlie engineering design.",
        "Complex Systems Analysis": "The study of systems with many interconnected components whose collective behavior is not easily predicted from the components alone.",
        "Risk & Reliability Engineering": "The engineering discipline of ensuring that a system will perform its intended function without failure for a specified time."
      }
    },
    "Nuclear, Plasma & Radiological Engineering": {
      "Fusion & Plasma Science": {
        "Plasma Physics": "The fundamental study of the behavior of ionized gases (plasmas), the fourth state of matter.",
        "Fusion Technology & Engineering": "The development of the technologies and materials needed to build a fusion power plant.",
        "Plasma-Material Interactions": "The study of how hot plasmas interact with the materials that contain them, a key challenge in fusion energy.",
        "Low-Temperature Plasmas": "The study and application of plasmas at near-room temperature, used in semiconductor manufacturing and lighting."
      },
      "Nuclear Materials & Waste Management": {
        "Radiation Effects on Materials": "The study of how high-energy radiation alters the properties of materials in nuclear reactors.",
        "Nuclear Fuel Cycle": "The entire process from mining uranium to disposing of nuclear waste.",
        "Radioactive Waste Disposal": "The development of safe and permanent solutions for the disposal of high-level radioactive waste.",
        "Nuclear Safeguards & Security": "The technical measures to prevent the proliferation of nuclear weapons and secure nuclear materials."
      },
      "Radiation, Instrumentation & Imaging": {
        "Radiation Detection & Measurement": "The design of instruments to detect and measure ionizing radiation.",
        "Medical Imaging Physics": "The physics principles behind medical imaging modalities like X-ray, CT, PET, and MRI.",
        "Radiation Shielding & Dosimetry": "The design of materials to block radiation and the measurement of absorbed radiation doses.",
        "Homeland Security Applications": "The use of radiation detection technologies to prevent nuclear terrorism and secure borders."
      },
      "Reactor Physics & Thermal Hydraulics": {
        "Neutronics & Reactor Analysis": "The study of the behavior of neutrons in a nuclear reactor, which governs the chain reaction.",
        "Advanced Reactor Design": "The development of new, safer, and more efficient nuclear reactor designs.",
        "Nuclear Power Plant Safety": "The analysis and engineering of systems to ensure the safe operation of nuclear power plants.",
        "Multiphase Flow & Heat Transfer": "The study of fluid flow and heat transfer in the complex conditions inside a nuclear reactor core."
      }
    }
  },
"College of Liberal Arts & Sciences": {
    "Biological sciences": {
      "Anthropology": {
        "Archaeology": "The study of human history and prehistory through the excavation of sites and the analysis of physical remains.",
        "Biological Anthropology": "The study of the biological and behavioral aspects of human beings, their related non-human primates, and their extinct hominin ancestors.",
        "Sociocultural Anthropology": "The study of cultural variation among humans, often through ethnographic fieldwork and participant observation.",
        "Linguistic Anthropology": "The study of how language influences social life, cultural identity, and systems of belief."
      },
      "Biochemistry": {
        "Enzymology & Protein Structure": "The study of enzyme mechanisms, protein folding, and the relationship between protein structure and function.",
        "Metabolic Regulation": "The study of the biochemical pathways that govern energy production and consumption in living cells.",
        "Molecular Genetics": "The study of the molecular structure and function of genes, including DNA replication, transcription, and translation."
      },
      "Biophysics & Quantitative Biology": {
        "Molecular Biophysics": "Using physical principles and computational methods to study the structure, dynamics, and function of biological molecules.",
        "Cellular Biophysics": "Applying physical and quantitative approaches to understand the mechanical, electrical, and structural properties of living cells.",
        "Systems & Computational Biology": "The use of quantitative models and computation to understand the behavior and interactions of complex biological systems."
      },
      "Cell & Developmental Biology": {
        "Developmental Biology & Genetics": "The study of the processes by which organisms grow and develop, and the genetic mechanisms that control them.",
        "Cell Biology & Signaling": "The study of cell structure, function, and the communication pathways that regulate cell behavior and fate.",
        "Neurobiology": "The study of the cellular and molecular basis of nervous system function, development, and disease."
      },
      "Entomology": {
        "Insect Systematics & Evolution": "The study of the classification, biodiversity, and evolutionary history of insects.",
        "Pest Management & Applied Ecology": "The development of sustainable strategies for managing insect pests in agricultural, urban, and public health contexts.",
        "Molecular & Genomic Entomology": "The use of genomic and molecular tools to study insect physiology, behavior, genetics, and toxicology."
      },
      "Evolution, Ecology, and Behavior": {
        "Evolutionary Biology": "The study of the evolutionary processes, such as natural selection and genetic drift, that have given rise to the diversity of life.",
        "Ecology": "The study of the interactions between organisms and their environment, from the level of individuals to entire ecosystems.",
        "Animal Behavior": "The study of the mechanisms, development, function, and evolution of animal behavior, including its neural and hormonal bases."
      },
      "Integrative Biology": {
        "Entomology": "The study of insects and their relationship with humans, the environment, and other organisms.",
        "Evolution, Ecology, and Behavior": "The study of the principles of ecology, evolutionary biology, and animal behavior.",
        "Plant Biology": "The study of plant life, from molecular and cellular processes to ecosystem dynamics."
      },
      "Microbiology": {
        "Microbial Physiology & Metabolism": "The study of the life processes, growth, and metabolic pathways of microorganisms.",
        "Virology": "The study of viruses, their structure, replication, and interaction with host cells.",
        "Immunology & Pathogenesis": "The study of the immune system's response to pathogens and the mechanisms by which microbes cause disease."
      },
      "Molecular & Cellular Biology": {
        "Biochemistry": "The study of the chemical processes within and related to living organisms.",
        "Cell & Developmental Biology": "The study of the structure, function, and development of cells, tissues, and organisms.",
        "Microbiology": "The study of microorganisms, including bacteria, viruses, fungi, and protists.",
        "Molecular & Integrative Physiology": "The study of the functions of living organisms, from molecules to whole-body systems."
      },
      "Molecular & Integrative Physiology": {
        "Cardiovascular & Respiratory Physiology": "The study of the heart, blood vessels, and respiratory system in health and disease.",
        "Endocrinology & Metabolism": "The study of hormones and the metabolic processes that govern energy and nutrient balance.",
        "Neurophysiology": "The study of the function of the nervous system, including neural signaling, plasticity, and sensory processing."
      },
      "Neuroscience Program": {
        "Behavioral & Cognitive Neuroscience": "The study of the neural mechanisms underlying behavior, cognition, learning, and memory.",
        "Cellular & Molecular Neuroscience": "The study of the nervous system at the level of individual cells, synapses, and molecules.",
        "Systems & Computational Neuroscience": "The study of neural circuits and the use of computational models to understand brain function."
      },
      "Plant Biology": {
        "Plant Physiology & Molecular Biology": "The study of plant functions, from photosynthesis and metabolism to gene expression and development.",
        "Plant Ecology & Environmental Biology": "The study of how plants interact with their environment and respond to global change.",
        "Plant Systematics & Evolution": "The study of the diversification, classification, and evolutionary relationships of plants."
      },
      "Psychology": {
        "Behavioral Neuroscience": "The study of the biological bases of psychological processes and behavior.",
        "Clinical & Community Psychology": "The assessment, treatment, and prevention of mental illness at individual and community levels.",
        "Cognitive Neuroscience": "The study of the neural mechanisms underlying cognition, often using brain imaging techniques.",
        "Cognitive Psychology": "The study of mental processes such as attention, language use, memory, and problem-solving.",
        "Developmental Psychology": "The scientific study of how and why human beings change over the course of their life.",
        "Industrial-Organizational Psychology": "The application of psychological principles to the workplace to improve productivity and well-being.",
        "Social-Personality Psychology": "The study of how individuals' thoughts, feelings, and behaviors are influenced by others and individual differences."
      }
    },
    "Language and culture": {
      "Classics": {
        "Greek & Latin Philology": "The study of Greek and Latin languages and literatures, including textual criticism and interpretation.",
        "Ancient History": "The study of the political, social, and economic history of ancient Greece and Rome.",
        "Classical Archaeology & Art": "The study of the material culture, art, and architecture of the ancient Mediterranean world.",
        "Classical Philosophy": "The study of the philosophical traditions originating in ancient Greece and Rome."
      },
      "Comparative & World Literature": {
        "Literary Theory & Criticism": "The study of the principles and methods for interpreting and evaluating literature across cultures.",
        "Transnational & Postcolonial Studies": "The study of literature that transcends national borders and engages with legacies of colonialism and global movements.",
        "Interdisciplinary & Thematic Studies": "The comparative study of literature through central themes, genres, or in relation to other arts like film and media."
      },
      "East Asian Languages & Cultures": {
        "Chinese Studies": "The study of the language, literature, history, and culture of China.",
        "Japanese Studies": "The study of the language, literature, history, and culture of Japan.",
        "Korean Studies": "The study of the language, literature, history, and culture of Korea."
      },
      "Foreign Language Teacher Education Program": {
        "Second Language Acquisition (SLA)": "The study of the cognitive and social processes by which people learn a second language.",
        "Language Pedagogy & Assessment": "The theory and practice of language teaching methods, curriculum design, and student evaluation.",
        "Technology-Enhanced Language Learning": "The integration and study of digital tools and media to support language education."
      },
      "French & Italian": {
        "French & Francophone Studies": "The study of the language, literature, and cultures of France and the French-speaking world.",
        "Italian Studies": "The study of the language, literature, and culture of Italy, from medieval to contemporary."
      },
      "Germanic Languages & Literatures": {
        "German Studies": "The study of the language, literature, film, and culture of the German-speaking countries.",
        "Scandinavian Studies": "The study of the languages, literatures, and cultures of Denmark, Norway, Sweden, Finland, and Iceland.",
        "Yiddish Studies": "The study of Yiddish language, literature, and culture, particularly in European and American contexts."
      },
      "Global Studies, LAS": {
        "Global Cultures & Societies": "The study of cultural globalization, transnational identities, global media flows, and human rights.",
        "Global Health & Environment": "The study of global health challenges, environmental sustainability, development, and their policy implications.",
        "Global Politics & Economies": "The study of international relations, global political economy, governance, and security."
      },
      "Illinois Global Institute": {
        "Center for African Studies (CAS)": "Interdisciplinary research and teaching on the diverse cultures, societies, and languages of Africa.",
        "Center for East Asian & Pacific Studies (CEAPS)": "Promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
        "Center for Global Studies (CGS)": "Fostering research and education on global issues, themes, and processes that transcend national borders.",
        "Center for Latin American & Caribbean Studies (CLACS)": "Supporting research and training on the histories, cultures, and contemporary issues of Latin America and the Caribbean.",
        "Center for South Asian & Middle Eastern Studies (CSAMES)": "Promoting scholarship, teaching, and public engagement on South Asia and the Middle East.",
        "European Union Center (EUC)": "An interdisciplinary center focused on the study of the European Union, its institutions, and transatlantic relations.",
        "Russian, East European, and Eurasian Center (REEEC)": "Supporting the interdisciplinary study of Russia, Eastern Europe, and the Eurasian region."
      },
      "Jewish Culture & Society": {
        "Hebrew Language & Literature": "The study of classical, rabbinic, and modern Hebrew language, literature, and textual traditions.",
        "History of the Jewish People": "The study of Jewish history from antiquity through the modern era, including diaspora, the Holocaust, and Jewish-gentile relations.",
        "Israel Studies": "The interdisciplinary study of the modern state of Israel, its politics, society, and culture."
      },
      "Linguistics": {
        "Computational Linguistics": "The interdisciplinary field modeling natural language from a computational perspective, including NLP.",
        "Phonetics & Phonology": "The study of the sounds of human speech (phonetics) and their systematic organization in language (phonology).",
        "Psycholinguistics": "The study of the psychological and neurobiological factors enabling humans to acquire, use, and understand language.",
        "Semantics & Pragmatics": "The study of meaning in language, both in its literal sense (semantics) and its contextual, inferred sense (pragmatics).",
        "Syntax": "The study of the rules and principles that govern the sentence structure of languages."
      },
      "Literatures, Cultures & Linguistics": {
        "Classics": "The study of the languages, literatures, and cultures of ancient Greece and Rome.",
        "Comparative & World Literature": "The study of literature across national, linguistic, and cultural boundaries.",
        "East Asian Languages & Cultures": "The study of the languages and cultures of China, Japan, and Korea.",
        "French & Italian": "The study of the languages, literatures, and cultures of the French- and Italian-speaking worlds.",
        "Germanic Languages & Literatures": "The study of the languages and cultures of the Germanic, Scandinavian, and Yiddish-speaking worlds.",
        "Linguistics": "The scientific study of human language, its structure, use, and cognitive basis.",
        "Religion": "The academic and interdisciplinary study of religious traditions and phenomena.",
        "Slavic Languages & Literatures": "The study of the languages, literatures, and cultures of Russia and Eastern Europe.",
        "Spanish & Portuguese": "The study of the languages, literatures, and cultures of the Spanish- and Portuguese-speaking worlds."
      },
      "Slavic Languages & Literatures": {
        "Russian Language & Literature": "The study of Russian language, and its literary tradition from the 19th century to the present.",
        "East European & Eurasian Studies": "The study of the languages and cultures of Poland, the Czech Republic, Ukraine, and other post-Soviet states.",
        "Slavic Linguistics": "The comparative and historical study of the Slavic language family."
      },
      "Spanish & Portuguese": {
        "Spanish Linguistics": "The study of the structure, history, acquisition, and variation of the Spanish language.",
        "Latin American Literatures & Cultures": "The study of the diverse literary and cultural traditions of Spanish-speaking America, from the colonial period to the present.",
        "Iberian (Spanish) Literatures & Cultures": "The study of the literary and cultural traditions of Spain, from medieval to contemporary.",
        "Portuguese (Luso-Brazilian) Studies": "The study of the languages, literatures, and cultures of Portugal and Brazil."
      },
      "Spurlock Museum": {
        "Cultural Heritage & Museum Studies": "The theory and practice of museum curation, collection management, preservation, and public engagement.",
        "Global Material Culture": "The study of human history and culture through tangible objects and artifacts from diverse world cultures."
      },
      "Translation and Interpreting Studies": {
        "Translation Theory & Practice": "The study of the principles and history of translation and its application across various genres.",
        "Interpreting Studies": "The study of the theory and practice of simultaneous and consecutive interpreting in various contexts (e.g., medical, legal).",
        "Localization & Translation Technology": "The adaptation of products and content for specific locales and the use of computer-aided translation tools."
      },
      "Writing Studies": {
        "Rhetoric & Composition": "The study of the theory, history, and practice of writing, persuasion, and argumentation.",
        "Writing Across the Curriculum (WAC)": "The support and study of writing and pedagogy in disciplines across the university.",
        "Writing Center & Tutoring Pedagogy": "The theory and practice of one-on-one writing instruction and support in a writing center context."
      }
    },
    "Chemical sciences": {
      "Biochemistry": {
        "Enzymology & Protein Structure": "The study of enzyme mechanisms, protein folding, and the relationship between protein structure and function.",
        "Metabolic Regulation": "The study of the biochemical pathways that govern energy production and consumption in living cells.",
        "Molecular Genetics": "The study of the molecular structure and function of genes, including DNA replication, transcription, and translation."
      },
      "Chemical & Biomolecular Engineering": {
        "Biomolecular & Cellular Engineering": "The application of engineering principles to biological systems, including synthetic biology, metabolic engineering, and drug delivery.",
        "Energy & Sustainability": "The development of chemical processes for renewable energy, sustainable fuels, and environmental remediation.",
        "Materials & Nanotechnology": "The design and synthesis of advanced polymers, nanomaterials, and soft matter for various applications.",
        "Process Systems & Computational Modeling": "The use of simulation, data science, and optimization to design and control chemical processes."
      },
      "Chemical Sciences": {
        "Chemical & Biomolecular Engineering": "The application of engineering principles to molecular-level problems in energy, health, and materials.",
        "Chemistry": "The fundamental study of matter, its properties, composition, and the changes it undergoes."
      },
      "Chemistry": {
        "Analytical Chemistry": "The science of chemical measurement, separation, instrumentation, and data analysis.",
        "Chemical Biology": "The application of chemical techniques, tools, and molecules to study and manipulate biological systems.",
        "Inorganic Chemistry": "The study of the synthesis, structure, and properties of inorganic and organometallic compounds, including catalysis and materials.",
        "Materials Chemistry": "The design, synthesis, and characterization of new functional materials, including polymers and nanomaterials.",
        "Organic Chemistry": "The study of the structure, properties, reactions, and synthesis of carbon-containing compounds.",
        "Physical Chemistry": "The study of chemical phenomena using the principles of physics, including spectroscopy, dynamics, and quantum mechanics.",
        "Theoretical & Computational Chemistry": "The use of computer simulation and mathematical models to understand and predict chemical behavior."
      }
    },
    "Humanities": {
      "African American Studies": {
        "African American History & Politics": "The study of the historical and political experiences of the African diaspora in the Americas.",
        "African American Literature & Culture": "The critical study of literature, music, film, and other cultural expressions of the Black experience.",
        "Race, Gender & Social Justice": "The interdisciplinary analysis of the intersection of race, gender, and class in relation to power and social structures."
      },
      "American Indian Studies": {
        "Indigenous Knowledges & Sovereignty": "The study of Indigenous intellectual traditions, governance, decolonization, and rights.",
        "American Indian Histories & Cultures": "The study of the diverse histories, languages, and cultural practices of Native American peoples.",
        "Indigenous Media & Representation": "The critical analysis of the representation of Indigenous peoples and the study of media created by them."
      },
      "Anthropology": {
        "Archaeology": "The study of human history and prehistory through the excavation of sites and the analysis of physical remains.",
        "Biological Anthropology": "The study of the biological and behavioral aspects of human beings, their related non-human primates, and their extinct hominin ancestors.",
        "Sociocultural Anthropology": "The study of cultural variation among humans, often through ethnographic fieldwork and participant observation.",
        "Linguistic Anthropology": "The study of how language influences social life, cultural identity, and systems of belief."
      },
      "Asian American Studies": {
        "Asian American History & Communities": "The study of the history of Asian migration, community formation, and racialization in the U.S.",
        "Asian American Literature & Cultural Studies": "The critical study of literary and cultural production by and about Asian Americans.",
        "Race, Politics & Social Justice": "The analysis of Asian American experiences within broader U.S. racial dynamics, law, and social movements."
      },
      "Classics": {
        "Greek & Latin Philology": "The study of Greek and Latin languages and literatures, including textual criticism and interpretation.",
        "Ancient History": "The study of the political, social, and economic history of ancient Greece and Rome.",
        "Classical Archaeology & Art": "The study of the material culture, art, and architecture of the ancient Mediterranean world.",
        "Classical Philosophy": "The study of the philosophical traditions originating in ancient Greece and Rome."
      },
      "Communication": {
        "Health Communication": "The study and use of communication strategies to inform and influence individual and community health decisions.",
        "Interpersonal & Organizational Communication": "The study of communication processes in personal relationships, groups, and complex organizations.",
        "Media & Cinema Studies": "The critical analysis of film, television, and digital media, their history, and their effects on society and culture.",
        "Rhetoric & Public Discourse": "The study of the art of persuasion and argumentation in public life, from political speeches to social movements."
      },
      "Comparative & World Literature": {
        "Literary Theory & Criticism": "The study of the principles and methods for interpreting and evaluating literature across cultures.",
        "Transnational & Postcolonial Studies": "The study of literature that transcends national borders and engages with legacies of colonialism and global movements.",
        "Interdisciplinary & Thematic Studies": "The comparative study of literature through central themes, genres, or in relation to other arts like film and media."
      },
      "Criticism & Interpretive Theory": {
        "Critical Theory": "The interdisciplinary study of post-structuralist, post-colonial, and Frankfurt School theories and their application.",
        "Psychoanalysis & Social Theory": "The application of psychoanalytic concepts to the study of culture, society, and politics.",
        "Aesthetics & Media Theory": "The philosophical and theoretical study of art, media, and sensory experience."
      },
      "East Asian Languages & Cultures": {
        "Chinese Studies": "The study of the language, literature, history, and culture of China.",
        "Japanese Studies": "The study of the language, literature, history, and culture of Japan.",
        "Korean Studies": "The study of the language, literature, history, and culture of Korea."
      },
      "English": {
        "American Literature": "The study of the literary traditions of the United States, from colonization to the present.",
        "British & Anglophone Literature": "The study of literature in English from the British Isles and the global Anglophone world.",
        "Creative Writing": "The practice, pedagogy, and craft of writing poetry, fiction, and creative non-fiction.",
        "Media & Cinema Studies": "The critical analysis of film, digital media, television, and their cultural impact.",
        "Writing Studies & Rhetoric": "The study of the theory, history, and practice of writing, persuasion, and composition."
      },
      "Foreign Language Teacher Education Program": {
        "Second Language Acquisition (SLA)": "The study of the cognitive and social processes by which people learn a second language.",
        "Language Pedagogy & Assessment": "The theory and practice of language teaching methods, curriculum design, and student evaluation.",
        "Technology-Enhanced Language Learning": "The integration and study of digital tools and media to support language education."
      },
      "French & Italian": {
        "French & Francophone Studies": "The study of the language, literature, and cultures of France and the French-speaking world.",
        "Italian Studies": "The study of the language, literature, and culture of Italy, from medieval to contemporary."
      },
      "Gender & Women's Studies": {
        "Transnational & Postcolonial Feminisms": "The study of gender and feminist movements in global, colonial, and post-colonial contexts.",
        "Queer Studies & Sexuality": "The interdisciplinary study of sexuality and gender identity, focusing on LGBTQ+ experiences and critical theory.",
        "Gender, Race & Intersectionality": "The analysis of the overlapping and interdependent systems of discrimination related to gender, race, class, and other social categories."
      },
      "Germanic Languages & Literatures": {
        "German Studies": "The study of the language, literature, film, and culture of the German-speaking countries.",
        "Scandinavian Studies": "The study of the languages, literatures, and cultures of Denmark, Norway, Sweden, Finland, and Iceland.",
        "Yiddish Studies": "The study of Yiddish language, literature, and culture, particularly in European and American contexts."
      },
      "History": {
        "American History": "The study of the political, social, and cultural development of the United States.",
        "European History": "The study of the past in the European continent, from antiquity to the present.",
        "Global & Transnational History": "The study of historical connections and interactions that transcend national borders, including empire and migration.",
        "History of Science, Technology & Medicine": "The study of how scientific knowledge, technological systems, and medical practices have developed and shaped society.",
        "Pre-Modern History (Ancient/Medieval)": "The study of human history from antiquity through the early modern period."
      },
      "Jewish Culture & Society": {
        "Hebrew Language & Literature": "The study of classical, rabbinic, and modern Hebrew language, literature, and textual traditions.",
        "History of the Jewish People": "The study of Jewish history from antiquity through the modern era, including diaspora, the Holocaust, and Jewish-gentile relations.",
        "Israel Studies": "The interdisciplinary study of the modern state of Israel, its politics, society, and culture."
      },
      "Latina/Latino Studies": {
        "Latina/o History & Social Movements": "The study of the history of Latinx peoples in the U.S., including their political and social activism.",
        "Latina/o Literature & Cultural Studies": "The critical study of literary, cinematic, and cultural productions by and about Latinx communities.",
        "Transnationalism, Migration & Borders": "The study of the social, political, and cultural aspects of migration and border experiences."
      },
      "Linguistics": {
        "Computational Linguistics": "The interdisciplinary field modeling natural language from a computational perspective, including NLP.",
        "Phonetics & Phonology": "The study of the sounds of human speech (phonetics) and their systematic organization in language (phonology).",
        "Psycholinguistics": "The study of the psychological and neurobiological factors enabling humans to acquire, use, and understand language.",
        "Semantics & Pragmatics": "The study of meaning in language, both in its literal sense (semantics) and its contextual, inferred sense (pragmatics).",
        "Syntax": "The study of the rules and principles that govern the sentence structure of languages."
      },
      "Literatures, Cultures & Linguistics": {
        "Classics": "The study of the languages, literatures, and cultures of ancient Greece and Rome.",
        "Comparative & World Literature": "The study of literature across national, linguistic, and cultural boundaries.",
        "East Asian Languages & Cultures": "The study of the languages and cultures of China, Japan, and Korea.",
        "French & Italian": "The study of the languages, literatures, and cultures of the French- and Italian-speaking worlds.",
        "Germanic Languages & Literatures": "The study of the languages and cultures of the Germanic, Scandinavian, and Yiddish-speaking worlds.",
        "Linguistics": "The scientific study of human language, its structure, use, and cognitive basis.",
        "Religion": "The academic and interdisciplinary study of religious traditions and phenomena.",
        "Slavic Languages & Literatures": "The study of the languages, literatures, and cultures of Russia and Eastern Europe.",
        "Spanish & Portuguese": "The study of the languages, literatures, and cultures of the Spanish- and Portuguese-speaking worlds."
      },
      "Medieval Studies": {
        "Medieval History & Society": "The study of the social, political, and religious history of the Middle Ages.",
        "Medieval Literature & Philology": "The study of the languages and literatures of medieval Europe, including textual analysis.",
        "Medieval Art & Archaeology": "The study of the art, architecture, and material culture of the medieval period."
      },
      "Philosophy": {
        "Ethics & Political Philosophy": "The study of morality, justice, rights, and the nature of good government.",
        "Metaphysics & Epistemology": "The study of the fundamental nature of reality, existence, knowledge, and belief.",
        "Philosophy of Science": "The philosophical examination of the foundations, methods, and implications of various sciences.",
        "History of Philosophy": "The study of the major philosophical thinkers and traditions from antiquity to the present."
      },
      "Religion": {
        "Global Religions & Traditions": "The comparative study of major world religions, including Christianity, Islam, Judaism, Buddhism, and Hinduism.",
        "Religion & Society": "The study of the intersection of religion with politics, law, culture, and social issues.",
        "Text, History & Interpretation": "The critical and historical study of religious texts and traditions (e.g., Biblical studies)."
      },
      "Slavic Languages & Literatures": {
        "Russian Language & Literature": "The study of Russian language, and its literary tradition from the 19th century to the present.",
        "East European & Eurasian Studies": "The study of the languages and cultures of Poland, the Czech Republic, Ukraine, and other post-Soviet states.",
        "Slavic Linguistics": "The comparative and historical study of the Slavic language family."
      },
      "Sociology": {
        "Social Stratification & Inequality": "The study of the unequal distribution of resources, power, and privilege based on class, race, and gender.",
        "Political Sociology & Global Dynamics": "The study of power, social movements, and the state in a global context.",
        "Criminology & Law": "The study of crime, criminal behavior, and the legal system's response to it.",
        "Culture & Social Psychology": "The study of how culture shapes individual beliefs and social interactions."
      },
      "Spanish & Portuguese": {
        "Spanish Linguistics": "The study of the structure, history, acquisition, and variation of the Spanish language.",
        "Latin American Literatures & Cultures": "The study of the diverse literary and cultural traditions of Spanish-speaking America, from the colonial period to the present.",
        "Iberian (Spanish) Literatures & Cultures": "The study of the literary and cultural traditions of Spain, from medieval to contemporary.",
        "Portuguese (Luso-Brazilian) Studies": "The study of the languages, literatures, and cultures of Portugal and Brazil."
      },
      "Writing Studies": {
        "Rhetoric & Composition": "The study of the theory, history, and practice of writing, persuasion, and argumentation.",
        "Writing Across the Curriculum (WAC)": "The support and study of writing and pedagogy in disciplines across the university.",
        "Writing Center & Tutoring Pedagogy": "The theory and practice of one-on-one writing instruction and support in a writing center context."
      }
    },
    "Interdisciplinary research": {
      "African Studies": {
        "African Languages & Linguistics": "The study and teaching of major African languages and language families (e.g., Swahili, Wolof).",
        "Politics, History & Development": "The interdisciplinary study of political systems, historical trajectories, and economic development in Africa.",
        "African Arts, Culture & Society": "The study of the diverse literatures, arts, social structures, and health systems of the African continent."
      },
      "Advanced Social Research": {
        "Global Conflict & Violence": "The collection and analysis of data on global conflict, instability, and human rights violations.",
        "Data-Driven Social Research": "The development and application of computational methods to analyze large-scale text and social data.",
        "Media & Information Dynamics": "The study of how information and narratives shape public opinion and societal events."
      },
      "Criticism & Interpretive Theory": {
        "Critical Theory": "The interdisciplinary study of post-structuralist, post-colonial, and Frankfurt School theories and their application.",
        "Psychoanalysis & Social Theory": "The application of psychoanalytic concepts to the study of culture, society, and politics.",
        "Aesthetics & Media Theory": "The philosophical and theoretical study of art, media, and sensory experience."
      },
      "East Asian & Pacific Studies": {
        "East Asian Languages & Cultures": "Promoting the study of Chinese, Japanese, and Korean languages and cultural traditions.",
        "East Asian Politics & Society": "Interdisciplinary research on the contemporary politics, economies, and societies of East Asia.",
        "Transnational East Asia": "The study of connections and flows between East Asian countries and the rest of the world."
      },
      "European Union Studies": {
        "Transatlantic Relations & Security": "The study of the political, economic, and security relationship between Europe and North America.",
        "EU Governance & Public Policy": "Research on the institutions, decision-making processes, and policies of the European Union.",
        "European Society & Culture": "The study of contemporary European societies, migration, identity, and cultural politics."
      },
      "Global Studies": {
        "Global Health": "Interdisciplinary research on global health disparities, infectious diseases, and healthcare systems.",
        "Global Governance & Security": "The study of international organizations, human rights, and global security challenges.",
        "Global Environment & Sustainability": "The study of global environmental change, resource management, and sustainable development."
      },
      "Illinois Global Institute": {
        "Center for African Studies (CAS)": "Interdisciplinary research and teaching on the diverse cultures, societies, and languages of Africa.",
        "Center for East Asian & Pacific Studies (CEAPS)": "Promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
        "Center for Global Studies (CGS)": "Fostering research and education on global issues, themes, and processes that transcend national borders.",
        "Center for Latin American & Caribbean Studies (CLACS)": "Supporting research and training on the histories, cultures, and contemporary issues of Latin America and the Caribbean.",
        "Center for South Asian & Middle Eastern Studies (CSAMES)": "Promoting scholarship, teaching, and public engagement on South Asia and the Middle East.",
        "European Union Center (EUC)": "An interdisciplinary center focused on the study of the European Union, its institutions, and transatlantic relations.",
        "Russian, East European, and Eurasian Center (REEEC)": "Supporting the interdisciplinary study of Russia, Eastern Europe, and the Eurasian region."
      },
      "Latin American & Caribbean Studies": {
        "Latin American History & Politics": "The study of the historical and contemporary political and social dynamics of Latin America.",
        "Latin American & Caribbean Cultures": "The study of the diverse literatures, arts, and cultural expressions of the region.",
        "Indigenous & Diasporic Studies": "Research on Indigenous peoples and diasporic communities within Latin America and the Caribbean."
      },
      "Brazilian Studies": {
        "Brazilian Society & Culture": "Research on the diverse cultural, social, and artistic expressions of Brazil.",
        "Brazilian Politics & Development": "The study of Brazil's political institutions, economic development, and social inequality.",
        "Education & Public Policy in Brazil": "The study of educational systems and social policies within Brazil."
      },
      "Russian, East European, and Eurasian Studies": {
        "Russian Studies": "The interdisciplinary study of the history, politics, language, and culture of Russia.",
        "East European Studies": "The study of the politics, societies, and cultures of the Baltic states, Poland, Czechia, and the Balkans.",
        "Eurasian Studies": "Research on the languages, cultures, and politics of the Caucasus and Central Asia."
      },
      "South Asian & Middle Eastern Studies": {
        "South Asian Studies": "The study of the languages, cultures, religions, and politics of the Indian subcontinent.",
        "Middle Eastern Studies": "The study of the languages, cultures, religions, and politics of the Middle East and North Africa."
      },
      "Spurlock Museum": {
        "Cultural Heritage & Museum Studies": "The theory and practice of museum curation, collection management, preservation, and public engagement.",
        "Global Material Culture": "The study of human history and culture through tangible objects and artifacts from diverse world cultures."
      },
      "Study of Global Gender Equity": {
        "Gender & Development": "Research on the role of gender in economic development, poverty reduction, and resource access.",
        "Gender-Based Violence & Health": "The study of gender-based violence and its impact on public health and human rights.",
        "Transnational Feminisms": "The study of feminist movements and theories in a global and cross-cultural context."
      },
      "Writing Studies": {
        "Rhetoric & Composition": "The study of the theory, history, and practice of writing, persuasion, and argumentation.",
        "Writing Across the Curriculum (WAC)": "The support and study of writing and pedagogy in disciplines across the university.",
        "Writing Center & Tutoring Pedagogy": "The theory and practice of one-on-one writing instruction and support in a writing center context."
      }
    },
    "International and area studies": {
      "Arms Control & Domestic and International Security": {
        "Arms Control & Nonproliferation": "Research on treaties, technologies, and policies to limit the spread of nuclear, chemical, and biological weapons.",
        "International Security": "The study of conflict, defense policy, and emerging security threats between nations.",
        "Domestic Security & Counterterrorism": "The study of domestic extremism, homeland security, and counterterrorism strategies."
      },
      "African Studies": {
        "African Languages & Linguistics": "The study and teaching of major African languages and language families (e.g., Swahili, Wolof).",
        "Politics, History & Development": "The interdisciplinary study of political systems, historical trajectories, and economic development in Africa.",
        "African Arts, Culture & Society": "The study of the diverse literatures, arts, social structures, and health systems of the African continent."
      },
      "East Asian & Pacific Studies": {
        "East Asian Languages & Cultures": "Promoting the study of Chinese, Japanese, and Korean languages and cultural traditions.",
        "East Asian Politics & Society": "Interdisciplinary research on the contemporary politics, economies, and societies of East Asia.",
        "Transnational East Asia": "The study of connections and flows between East Asian countries and the rest of the world."
      },
      "European Union Studies": {
        "Transatlantic Relations & Security": "The study of the political, economic, and security relationship between Europe and North America.",
        "EU Governance & Public Policy": "Research on the institutions, decision-making processes, and policies of the European Union.",
        "European Society & Culture": "The study of contemporary European societies, migration, identity, and cultural politics."
      },
      "Global Studies": {
        "Global Health": "Interdisciplinary research on global health disparities, infectious diseases, and healthcare systems.",
        "Global Governance & Security": "The study of international organizations, human rights, and global security challenges.",
        "Global Environment & Sustainability": "The study of global environmental change, resource management, and sustainable development."
      },
      "Global Studies, LAS": {
        "Global Cultures & Societies": "The study of cultural globalization, transnational identities, global media flows, and human rights.",
        "Global Health & Environment": "The study of global health challenges, environmental sustainability, development, and their policy implications.",
        "Global Politics & Economies": "The study of international relations, global political economy, governance, and security."
      },
      "Illinois Global Institute": {
        "Center for African Studies (CAS)": "Interdisciplinary research and teaching on the diverse cultures, societies, and languages of Africa.",
        "Center for East Asian & Pacific Studies (CEAPS)": "Promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
        "Center for Global Studies (CGS)": "Fostering research and education on global issues, themes, and processes that transcend national borders.",
        "Center for Latin American & Caribbean Studies (CLACS)": "Supporting research and training on the histories, cultures, and contemporary issues of Latin America and the Caribbean.",
        "Center for South Asian & Middle Eastern Studies (CSAMES)": "Promoting scholarship, teaching, and public engagement on South Asia and the Middle East.",
        "European Union Center (EUC)": "An interdisciplinary center focused on the study of the European Union, its institutions, and transatlantic relations.",
        "Russian, East European, and Eurasian Center (REEEC)": "Supporting the interdisciplinary study of Russia, Eastern Europe, and the Eurasian region."
      },
      "Latin American & Caribbean Studies": {
        "Latin American History & Politics": "The study of the historical and contemporary political and social dynamics of Latin America.",
        "Latin American & Caribbean Cultures": "The study of the diverse literatures, arts, and cultural expressions of the region.",
        "Indigenous & Diasporic Studies": "Research on Indigenous peoples and diasporic communities within Latin America and the Caribbean."
      },
      "Brazilian Studies": {
        "Brazilian Society & Culture": "Research on the diverse cultural, social, and artistic expressions of Brazil.",
        "Brazilian Politics & Development": "The study of Brazil's political institutions, economic development, and social inequality.",
        "Education & Public Policy in Brazil": "The study of educational systems and social policies within Brazil."
      },
      "Russian, East European, and Eurasian Studies": {
        "Russian Studies": "The interdisciplinary study of the history, politics, language, and culture of Russia.",
        "East European Studies": "The study of the politics, societies, and cultures of the Baltic states, Poland, Czechia, and the Balkans.",
        "Eurasian Studies": "Research on the languages, cultures, and politics of the Caucasus and Central Asia."
      },
      "South Asian & Middle Eastern Studies": {
        "South Asian Studies": "The study of the languages, cultures, religions, and politics of the Indian subcontinent.",
        "Middle Eastern Studies": "The study of the languages, cultures, religions, and politics of the Middle East and North Africa."
      },
      "Study of Global Gender Equity": {
        "Gender & Development": "Research on the role of gender in economic development, poverty reduction, and resource access.",
        "Gender-Based Violence & Health": "The study of gender-based violence and its impact on public health and human rights.",
        "Transnational Feminisms": "The study of feminist movements and theories in a global and cross-cultural context."
      }
    },
    "Mathematical sciences": {
      "Mathematics": {
        "Algebra": "The study of mathematical structures like groups, rings, and fields, including algebraic geometry and representation theory.",
        "Analysis": "The study of limits, continuity, and integration, including real, complex, and functional analysis and PDEs.",
        "Applied & Computational Mathematics": "The development of mathematical and computational methods for problems in science and engineering.",
        "Geometry & Topology": "The study of the properties of space, shape, and dimension, including differential geometry and algebraic topology.",
        "Logic & Foundations": "The study of the principles of valid reasoning and the foundational axioms of mathematics.",
        "Number Theory": "The study of integers and their properties, including analytic and algebraic number theory.",
        "Probability": "The branch of mathematics concerning the analysis of random phenomena and stochastic processes."
      },
      "Statistics": {
        "Applied Statistics & Biostatistics": "The application of statistical methods to solve real-world problems in medicine, biology, finance, and other domains.",
        "Computational Statistics & Data Science": "The intersection of computer science and statistics, focusing on algorithms, machine learning, and analysis of large, complex datasets.",
        "Statistical Theory & Methods": "The development of the fundamental mathematical principles of statistical inference, modeling, and probability."
      }
    },
    "Physical sciences": {
      "Astronomy": {
        "Observational Astronomy": "The study of celestial objects by observing them with telescopes across the electromagnetic spectrum (e.g., optical, radio, x-ray).",
        "Theoretical & Computational Astrophysics": "The use of physical models and computer simulations to understand celestial phenomena, from stars to galaxies.",
        "Cosmology & General Relativity": "The study of the origin, evolution, and large-scale structure of the universe, including dark matter and dark energy."
      },
      "Atmospheric Sciences": {
        "Climate & Climate Change": "The study of long-term weather patterns and the impact of human activity on the global climate system.",
        "Atmospheric Chemistry & Physics": "The study of the chemical composition and physical processes of the atmosphere, including air quality and aerosol science.",
        "Weather & Dynamic Meteorology": "The study of short-term atmospheric phenomena, weather forecasting, and the fluid dynamics of the atmosphere."
      },
      "Biophysics & Quantitative Biology": {
        "Molecular Biophysics": "Using physical principles and computational methods to study the structure, dynamics, and function of biological molecules.",
        "Cellular Biophysics": "Applying physical and quantitative approaches to understand the mechanical, electrical, and structural properties of living cells.",
        "Systems & Computational Biology": "The use of quantitative models and computation to understand the behavior and interactions of complex biological systems."
      },
      "Earth, Society & Environment": {
        "Atmospheric Sciences": "The study of weather, climate, and the chemical and physical properties of the atmosphere.",
        "Earth Science & Environmental Change": "The study of the solid Earth, its history, materials, and processes, including environmental change.",
        "Geography & Geographic Information Science": "The study of the Earth's landscapes, peoples, and the spatial technologies used to analyze them."
      },
      "Ecology, Evolution & Conservation Biology": {
        "Conservation Biology & Restoration Ecology": "The applied science of protecting biodiversity, managing natural resources, and restoring degraded ecosystems.",
        "Ecosystem Science": "The study of the interactions between living organisms and their physical environment as an integrated system.",
        "Evolutionary Biology": "The study of the evolutionary processes (like natural selection and genetic drift) that shape the diversity of life."
      },
      "Geography & Geographic Information Science": {
        "Geographic Information Science (GIS)": "The development and application of technologies for capturing, analyzing, visualizing, and interpreting spatial data.",
        "Human Geography": "The study of the spatial organization of human society, including urban, economic, political, and cultural geography.",
        "Physical Geography & Environmental Systems": "The study of the Earth's natural systems, including climatology, geomorphology, and biogeography."
      },
      "Earth Science & Environmental Change": {
        "Geology & Geophysics": "The study of the solid Earth, its materials, and the physical processes that shape it, including plate tectonics and seismology.",
        "Hydrogeology & Environmental Geoscience": "The study of groundwater, water resources, and the interaction of geology with environmental contaminants.",
        "Paleoclimatology & Earth System History": "The study of Earth's past climates and environmental history as recorded in rocks, sediments, and ice cores."
      }
    },
    "Race, ethnicity, indigeneity, and gender": {
      "African American Studies": {
        "African American History & Politics": "The study of the historical and political experiences of the African diaspora in the Americas.",
        "African American Literature & Culture": "The critical study of literature, music, film, and other cultural expressions of the Black experience.",
        "Race, Gender & Social Justice": "The interdisciplinary analysis of the intersection of race, gender, and class in relation to power and social structures."
      },
      "American Indian Studies": {
        "Indigenous Knowledges & Sovereignty": "The study of Indigenous intellectual traditions, governance, decolonization, and rights.",
        "American Indian Histories & Cultures": "The study of the diverse histories, languages, and cultural practices of Native American peoples.",
        "Indigenous Media & Representation": "The critical analysis of the representation of Indigenous peoples and the study of media created by them."
      },
      "Asian American Studies": {
        "Asian American History & Communities": "The study of the history of Asian migration, community formation, and racialization in the U.S.",
        "Asian American Literature & Cultural Studies": "The critical study of literary and cultural production by and about Asian Americans.",
        "Race, Politics & Social Justice": "The analysis of Asian American experiences within broader U.S. racial dynamics, law, and social movements."
      },
      "Gender & Women's Studies": {
        "Transnational & Postcolonial Feminisms": "The study of gender and feminist movements in global, colonial, and post-colonial contexts.",
        "Queer Studies & Sexuality": "The interdisciplinary study of sexuality and gender identity, focusing on LGBTQ+ experiences and critical theory.",
        "Gender, Race & Intersectionality": "The analysis of the overlapping and interdependent systems of discrimination related to gender, race, class, and other social categories."
      },
      "Illinois Global Institute": {
        "Center for African Studies (CAS)": "Interdisciplinary research and teaching on the diverse cultures, societies, and languages of Africa.",
        "Center for East Asian & Pacific Studies (CEAPS)": "Promoting the study of East Asia and the Pacific, including its languages, cultures, and societies.",
        "Center for Global Studies (CGS)": "Fostering research and education on global issues, themes, and processes that transcend national borders.",
        "Center for Latin American & Caribbean Studies (CLACS)": "Supporting research and training on the histories, cultures, and contemporary issues of Latin America and the Caribbean.",
        "Center for South Asian & Middle Eastern Studies (CSAMES)": "Promoting scholarship, teaching, and public engagement on South Asia and the Middle East.",
        "European Union Center (EUC)": "An interdisciplinary center focused on the study of the European Union, its institutions, and transatlantic relations.",
        "Russian, East European, and Eurasian Center (REEEC)": "Supporting the interdisciplinary study of Russia, Eastern Europe, and the Eurasian region."
      },
      "Latina/Latino Studies": {
        "Latina/o History & Social Movements": "The study of the history of Latinx peoples in the U.S., including their political and social activism.",
        "Latina/o Literature & Cultural Studies": "The critical study of literary, cinematic, and cultural productions by and about Latinx communities.",
        "Transnationalism, Migration & Borders": "The study of the social, political, and cultural aspects of migration and border experiences."
      },
      "Study of Global Gender Equity": {
        "Gender & Development": "Research on the role of gender in economic development, poverty reduction, and resource access.",
        "Gender-Based Violence & Health": "The study of gender-based violence and its impact on public health and human rights.",
        "Transnational Feminisms": "The study of feminist movements and theories in a global and cross-cultural context."
      }
    },
    "Social and behavioral sciences": {
      "African American Studies": {
        "African American History & Politics": "The study of the historical and political experiences of the African diaspora in the Americas.",
        "African American Literature & Culture": "The critical study of literature, music, film, and other cultural expressions of the Black experience.",
        "Race, Gender & Social Justice": "The interdisciplinary analysis of the intersection of race, gender, and class in relation to power and social structures."
      },
      "American Indian Studies": {
        "Indigenous Knowledges & Sovereignty": "The study of Indigenous intellectual traditions, governance, decolonization, and rights.",
        "American Indian Histories & Cultures": "The study of the diverse histories, languages, and cultural practices of Native American peoples.",
        "Indigenous Media & Representation": "The critical analysis of the representation of Indigenous peoples and the study of media created by them."
      },
      "Anthropology": {
        "Archaeology": "The study of human history and prehistory through the excavation of sites and the analysis of physical remains.",
        "Biological Anthropology": "The study of the biological and behavioral aspects of human beings, their related non-human primates, and their extinct hominin ancestors.",
        "Sociocultural Anthropology": "The study of cultural variation among humans, often through ethnographic fieldwork and participant observation.",
        "Linguistic Anthropology": "The study of how language influences social life, cultural identity, and systems of belief."
      },
      "Asian American Studies": {
        "Asian American History & Communities": "The study of the history of Asian migration, community formation, and racialization in the U.S.",
        "Asian American Literature & Cultural Studies": "The critical study of literary and cultural production by and about Asian Americans.",
        "Race, Politics & Social Justice": "The analysis of Asian American experiences within broader U.S. racial dynamics, law, and social movements."
      },
      "Advanced Social Research": {
        "Global Conflict & Violence": "The collection and analysis of data on global conflict, instability, and human rights violations.",
        "Data-Driven Social Research": "The development and application of computational methods to analyze large-scale text and social data.",
        "Media & Information Dynamics": "The study of how information and narratives shape public opinion and societal events."
      },
      "Communication": {
        "Health Communication": "The study and use of communication strategies to inform and influence individual and community health decisions.",
        "Interpersonal & Organizational Communication": "The study of communication processes in personal relationships, groups, and complex organizations.",
        "Media & Cinema Studies": "The critical analysis of film, television, and digital media, their history, and their effects on society and culture.",
        "Rhetoric & Public Discourse": "The study of the art of persuasion and argumentation in public life, from political speeches to social movements."
      },
      "Economics": {
        "Applied Microeconomics": "The application of microeconomic principles to study specific markets and behaviors, such as labor, health, and industrial organization.",
        "Econometrics": "The application of statistical methods to economic data to give empirical content to economic relationships.",
        "Economic Theory (Micro & Macro)": "The development of fundamental models of economic behavior at the individual (micro) and aggregate (macro) levels.",
        "International & Development Economics": "The study of economic interactions between countries and the economic challenges facing developing nations.",
        "Public & Labor Economics": "The study of government policy's role in the economy and the dynamics of labor markets and employment."
      },
      "Gender & Women's Studies": {
        "Transnational & Postcolonial Feminisms": "The study of gender and feminist movements in global, colonial, and post-colonial contexts.",
        "Queer Studies & Sexuality": "The interdisciplinary study of sexuality and gender identity, focusing on LGBTQ+ experiences and critical theory.",
        "Gender, Race & Intersectionality": "The analysis of the overlapping and interdependent systems of discrimination related to gender, race, class, and other social categories."
      },
      "Geography & Geographic Information Science": {
        "Geographic Information Science (GIS)": "The development and application of technologies for capturing, analyzing, visualizing, and interpreting spatial data.",
        "Human Geography": "The study of the spatial organization of human society, including urban, economic, political, and cultural geography.",
        "Physical Geography & Environmental Systems": "The study of the Earth's natural systems, including climatology, geomorphology, and biogeography."
      },
      "Global Studies, LAS": {
        "Global Cultures & Societies": "The study of cultural globalization, transnational identities, global media flows, and human rights.",
        "Global Health & Environment": "The study of global health challenges, environmental sustainability, development, and their policy implications.",
        "Global Politics & Economies": "The study of international relations, global political economy, governance, and security."
      },
      "Illinois in Washington Program": {
        "Public Policy & Governance": "The study and practice of policy-making within federal agencies, Congress, and think tanks.",
        "Civic Engagement & Advocacy": "Experiential learning in non-profit organizations, advocacy groups, and media.",
        "International Affairs & Law": "The practical application of international relations and legal studies in a professional setting."
      },
      "Latina/Latino Studies": {
        "Latina/o History & Social Movements": "The study of the history of Latinx peoples in the U.S., including their political and social activism.",
        "Latina/o Literature & Cultural Studies": "The critical study of literary, cinematic, and cultural productions by and about Latinx communities.",
        "Transnationalism, Migration & Borders": "The study of the social, political, and cultural aspects of migration and border experiences."
      },
      "Linguistics": {
        "Computational Linguistics": "The interdisciplinary field modeling natural language from a computational perspective, including NLP.",
        "Phonetics & Phonology": "The study of the sounds of human speech (phonetics) and their systematic organization in language (phonology).",
        "Psycholinguistics": "The study of the psychological and neurobiological factors enabling humans to acquire, use, and understand language.",
        "Semantics & Pragmatics": "The study of meaning in language, both in its literal sense (semantics) and its contextual, inferred sense (pragmatics).",
        "Syntax": "The study of the rules and principles that govern the sentence structure of languages."
      },
      "Neuroscience Program": {
        "Behavioral & Cognitive Neuroscience": "The study of the neural mechanisms underlying behavior, cognition, learning, and memory.",
        "Cellular & Molecular Neuroscience": "The study of the nervous system at the level of individual cells, synapses, and molecules.",
        "Systems & Computational Neuroscience": "The study of neural circuits and the use of computational models to understand brain function."
      },
      "Political Science": {
        "American Politics": "The study of political institutions, behavior, and policy in the United States.",
        "Comparative Politics": "The comparative study of different countries' political systems to understand their similarities and differences.",
        "International Relations": "The study of the interactions between nation-states, international organizations, and non-state actors in the global arena.",
        "Political Methodology": "The development and application of quantitative and qualitative methods for the scientific study of politics.",
        "Political Theory": "The study of fundamental questions about justice, power, rights, and the nature of the state."
      },
      "Psychology": {
        "Behavioral Neuroscience": "The study of the biological bases of psychological processes and behavior.",
        "Clinical & Community Psychology": "The assessment, treatment, and prevention of mental illness at individual and community levels.",
        "Cognitive Neuroscience": "The study of the neural mechanisms underlying cognition, often using brain imaging techniques.",
        "Cognitive Psychology": "The study of mental processes such as attention, language use, memory, and problem-solving.",
        "Developmental Psychology": "The scientific study of how and why human beings change over the course of their life.",
        "Industrial-Organizational Psychology": "The application of psychological principles to the workplace to improve productivity and well-being.",
        "Social-Personality Psychology": "The study of how individuals' thoughts, feelings, and behaviors are influenced by others and individual differences."
      },
      "Sociology": {
        "Social Stratification & Inequality": "The study of the unequal distribution of resources, power, and privilege based on class, race, and gender.",
        "Political Sociology & Global Dynamics": "The study of power, social movements, and the state in a global context.",
        "Criminology & Law": "The study of crime, criminal behavior, and the legal system's response to it.",
        "Culture & Social Psychology": "The study of how culture shapes individual beliefs and social interactions."
      }
    }
  },
  "College of Agricultural, Consumer & Environmental Sciences (ACES)": {
    "Agricultural & Consumer Economics": {
      "Agribusiness Management": {
        "Farm Management": "The application of business principles to the operation of a farm.",
        "Food & Agribusiness Marketing": "The marketing of agricultural products and food.",
        "Supply Chain Management": "The management of the flow of goods and services in the food and agricultural sector."
      },
      "Development Economics": {
        "Agricultural Development": "The study of economic development in the agricultural sector of developing countries.",
        "Poverty & Food Security": "The study of the causes of poverty and food insecurity and the design of policies to address them.",
        "International Trade & Policy": "The study of international trade in agricultural products and related government policies."
      },
      "Environmental & Resource Economics": {
        "Natural Resource Management": "The economic analysis of the management of natural resources such as forests, fisheries, and water.",
        "Climate Change Economics": "The economic analysis of the causes and consequences of climate change and policies to address it.",
        "Energy Economics & Policy": "The study of the supply and demand of energy from an economic perspective."
      },
      "Finance & Risk Management": {
        "Agricultural Finance": "The provision of financial services to the agricultural sector.",
        "Commodity Markets & Futures": "The study of markets for agricultural commodities and the use of financial instruments to manage price risk.",
        "Risk Analysis": "The assessment and management of risks in agriculture, such as weather and price volatility."
      },
      "Public Policy & Law": {
        "Agricultural Policy": "The study of government policies related to agriculture.",
        "Food Law & Policy": "The study of the laws and regulations that govern food production and safety.",
        "Environmental Law": "The study of the laws and regulations related to the environment."
      }
    },
    "Animal Sciences": {
      "Animal Behavior & Welfare": {
        "Applied Ethology": "The study of the behavior of animals in their natural or semi-natural habitats.",
        "Stress Physiology": "The study of the physiological responses of animals to stress.",
        "Animal Housing & Management": "The design of housing and management systems that promote animal welfare."
      },
      "Genetics, Genomics & Bioinformatics": {
        "Quantitative & Population Genetics": "The study of the genetic basis of continuously varying traits in populations.",
        "Livestock Genomics": "The application of genomics to improve the productivity and health of livestock.",
        "Computational Biology": "The use of computational methods to analyze biological data."
      },
      "Microbiology": {
        "Rumen Microbiology": "The study of the microbes that live in the rumen of ruminant animals.",
        "Gut Health & Microbiome": "The study of the microbes that live in the gastrointestinal tract and their role in animal health.",
        "Probiotics & Prebiotics": "The use of beneficial microbes and their food sources to improve animal health."
      },
      "Nutrition & Metabolism": {
        "Ruminant Nutrition": "The study of the nutritional requirements of ruminant animals like cattle and sheep.",
        "Monogastric Nutrition": "The study of the nutritional requirements of animals with a single-chambered stomach, like pigs and poultry.",
        "Nutritional Biochemistry": "The study of the biochemical processes involved in nutrition."
      },
      "Physiology": {
        "Reproductive Physiology": "The study of the physiological processes involved in reproduction.",
        "Lactation Biology": "The study of the biology of milk production.",
        "Growth & Developmental Physiology": "The study of the physiological processes involved in growth and development."
      }
    },
    "Crop Sciences": {
      "Agronomy & Agroecology": {
        "Soil & Water Management": "The management of soil and water resources for sustainable crop production.",
        "Sustainable Agriculture": "The practice of farming using principles of ecology.",
        "Crop Physiology": "The study of the functions of plants and their parts."
      },
      "Bioinformatics & Statistics": {
        "Genomic Prediction": "The use of genomic data to predict the performance of crops.",
        "Statistical Genetics": "The application of statistical methods to the study of genetics.",
        "Computational Biology": "The use of computational methods to study biological systems."
      },
      "Horticulture": {
        "Specialty Crop Production": "The cultivation of fruits, vegetables, nuts, and ornamental plants.",
        "Urban Agriculture": "The practice of cultivating, processing, and distributing food in or around urban areas.",
        "Plant Propagation": "The process of creating new plants from a variety of sources: seeds, cuttings, and other plant parts."
      },
      "Plant Breeding & Genetics": {
        "Molecular Breeding": "The use of molecular biology tools in plant breeding.",
        "Quantitative Genetics": "The study of the inheritance of continuously varying traits.",
        "Plant Genomics": "The study of the structure, function, evolution, and mapping of plant genomes."
      },
      "Plant Pathology & Weed Science": {
        "Molecular Plant-Microbe Interactions": "The study of the molecular basis of interactions between plants and microbes.",
        "Integrated Pest Management (IPM)": "An ecosystem-based strategy that focuses on long-term prevention of pests.",
        "Herbicide Resistance": "The study of how weeds evolve resistance to herbicides."
      }
    },
    "Food Science & Human Nutrition": {
      "Food Chemistry & Processing": {
        "Food Engineering": "The application of engineering principles to the design of food processing equipment.",
        "Flavor Chemistry": "The study of the chemical compounds that create the flavor of food.",
        "Food Ingredient Functionality": "The study of how different ingredients affect the properties of food."
      },
      "Food Microbiology & Safety": {
        "Foodborne Pathogens": "The study of the microorganisms that can cause food poisoning.",
        "Food Fermentation": "The use of microorganisms to produce fermented foods like cheese and yogurt.",
        "Food Preservation": "The methods used to prevent the spoilage of food."
      },
      "Human Nutrition & Metabolism": {
        "Clinical Nutrition": "The study of the relationship between diet and disease.",
        "Community Nutrition": "The promotion of good nutrition in communities.",
        "Molecular Nutrition & Nutrigenomics": "The study of how nutrients affect gene expression and how genetic variation affects the response to nutrients."
      },
      "Sensory Science": {
        "Sensory Evaluation Methods": "The methods used to measure human responses to food products.",
        "Consumer Product Testing": "The testing of food products with consumers to assess their acceptability.",
        "Psychophysics": "The study of the relationship between physical stimuli and the sensory experiences they produce."
      }
    },
    "Natural Resources & Environmental Sciences": {
      "Conservation Biology & Ecology": {
        "Population & Community Ecology": "The study of the dynamics of populations and communities of organisms.",
        "Conservation Genetics": "The use of genetic methods to conserve biodiversity.",
        "Invasion Biology": "The study of the ecology and management of invasive species."
      },
      "Environmental Science & Management": {
        "Soil Science & Biogeochemistry": "The study of the chemical, physical, biological, and mineralogical composition of soils.",
        "Water Quality & Watershed Management": "The management of water resources at the watershed scale to protect water quality.",
        "Restoration Ecology": "The practice of renewing and restoring degraded, damaged, or destroyed ecosystems."
      },
      "Fisheries & Wildlife Science": {
        "Wildlife Ecology & Management": "The study of the ecology of wild animals and the management of their populations.",
        "Fisheries Biology": "The study of the biology of fish and the management of fisheries.",
        "Human-Wildlife Interactions": "The study of the interactions between humans and wildlife, including conflict and conservation."
      }
    }
  },
  "Gies College of Business": {
    "Accountancy": {
      "Auditing & Assurance": {
        "Audit Quality & Regulation": "The study of the quality of financial statement audits and the regulations that govern them.",
        "Internal Control": "The processes implemented to provide reasonable assurance about the achievement of objectives in effectiveness and efficiency of operations, reliability of financial reporting, and compliance with laws.",
        "Data Analytics in Auditing": "The use of data analytics to improve the effectiveness and efficiency of audits."
      },
      "Financial Accounting": {
        "Capital Markets Research": "The study of the relationship between accounting information and stock prices.",
        "Financial Reporting & Disclosure": "The study of the information that firms disclose in their financial reports.",
        "Valuation": "The process of determining the present value of an asset."
      },
      "Managerial Accounting": {
        "Performance Measurement & Incentives": "The design of systems to measure and reward employee performance.",
        "Cost Management": "The management of costs to improve profitability.",
        "Corporate Governance": "The system of rules, practices, and processes by which a firm is directed and controlled."
      },
      "Taxation": {
        "Corporate Taxation": "The study of the taxation of corporations.",
        "Tax Policy": "The study of the design of tax systems.",
        "Individual & Behavioral Taxation": "The study of the taxation of individuals and how taxes affect their behavior."
      }
    },
    "Business Administration": {
      "Information Systems & Business Analytics": {
        "Economics of Information Systems": "The study of the economic aspects of information systems.",
        "Business Data Analytics": "The use of data and analytics to solve business problems.",
        "IT Strategy & Management": "The alignment of information technology strategy with business strategy.",
        "Social Media & Digital Platforms": "The study of the business implications of social media and digital platforms."
      },
      "Marketing": {
        "Consumer Behavior": "The study of how individuals and groups select, purchase, use, and dispose of goods and services.",
        "Marketing Analytics & Quantitative Modeling": "The use of data and quantitative models to make marketing decisions.",
        "Digital Marketing & Social Media": "The use of digital channels and social media to market products and services.",
        "Marketing Strategy & Branding": "The development of long-term marketing plans and the management of brand equity."
      },
      "Operations Management": {
        "Inventory & Logistics Management": "The management of the flow of goods from suppliers to customers.",
        "Service Operations": "The management of the production and delivery of services.",
        "Revenue Management": "The use of analytics to predict consumer behavior at the micro-market level and optimize product availability and price.",
        "Healthcare Operations": "The application of operations management principles to improve the delivery of healthcare."
      },
      "Organizational Behavior & Strategy": {
        "Strategic Management": "The management of an organization's resources to achieve its goals and objectives.",
        "Organizational Theory": "The study of the structure and design of organizations.",
        "Leadership & Teams": "The study of leadership and teamwork in organizations.",
        "Entrepreneurship": "The process of designing, launching, and running a new business."
      },
      "Supply Chain Management": {
        "Global Supply Chain Strategy": "The design and management of supply chains that span multiple countries.",
        "Procurement & Sourcing": "The process of acquiring goods and services from external sources.",
        "Logistics & Transportation": "The management of the movement and storage of goods.",
        "Supply Chain Analytics": "The use of data and analytics to improve supply chain performance."
      }
    },
    "Finance": {
      "Asset Pricing": {
        "Equity & Fixed Income Markets": "The study of the valuation of stocks and bonds.",
        "Derivatives & Risk Management": "The use of financial instruments to manage risk.",
        "Behavioral Finance": "The study of the effects of psychology on financial decisions."
      },
      "Corporate Finance": {
        "Mergers & Acquisitions": "The study of the process of combining two companies into one.",
        "Capital Structure": "The study of how a firm finances its overall operations and growth by using different sources of funds.",
        "Corporate Governance": "The study of the mechanisms by which firms are controlled and directed."
      },
      "Financial Intermediation": {
        "Banking & Financial Institutions": "The study of banks and other financial institutions.",
        "FinTech & Financial Innovation": "The study of the use of technology in finance.",
        "Household Finance": "The study of the financial decisions of households."
      },
      "Real Estate": {
        "Real Estate Finance & Investment": "The study of the financing and investment of real estate.",
        "Urban Economics": "The study of the economics of cities.",
        "Housing Markets": "The study of the supply and demand for housing."
      }
    }
  },
  "School of Information Sciences (iSchool)": {
    "Information Sciences": {
      "Archives & Special Collections": {
        "Digital Preservation": "The policies and practices for ensuring continued access to digital materials for as long as necessary.",
        "Curation & Stewardship": "The management and preservation of valuable collections of information for future use.",
        "Archival Theory & Practice": "The study of the principles and methods for managing and preserving records of enduring value."
      },
      "Data Science & Analytics": {
        "Data Curation & Management": "The active management of data throughout its lifecycle to ensure it remains fit for contemporary purposes.",
        "Applied Data Mining & Machine Learning": "The application of data mining and machine learning techniques to solve problems in information sciences.",
        "Information Visualization": "The use of visual representations of data to facilitate understanding and insight.",
        "FAIR & Open Data": "The principles of making data Findable, Accessible, Interoperable, and Reusable, and the promotion of open access to data."
      },
      "Human-Centered Design & Systems": {
        "Human-Computer Interaction (HCI)": "The design and evaluation of computer systems with a focus on human users.",
        "User Experience (UX) Research & Design": "The process of enhancing user satisfaction with a product by improving the usability, accessibility, and pleasure provided in the interaction.",
        "Computer-Supported Cooperative Work (CSCW)": "The study of how people work together with the help of computer systems.",
        "Social Computing": "The study of the intersection of social behavior and computational systems."
      },
      "Information Organization & Access": {
        "Knowledge Organization Systems": "The design of systems, such as classifications and thesauri, for organizing information.",
        "Metadata & Semantics": "The study of data that provides information about other data, and the study of meaning.",
        "Information Retrieval": "The science of searching for information within documents.",
        "Digital Libraries": "The design and management of digital collections of information."
      },
      "Knowledge Management & Information Policy": {
        "Information Ethics & Policy": "The study of ethical issues and policies related to the creation, use, and dissemination of information.",
        "Intellectual Property": "The study of the laws that protect creations of the mind, such as patents and copyrights.",
        "Scholarly Communication": "The study of how scholars in any field use and disseminate information through formal and informal channels.",
        "Information & Society": "The study of the social, cultural, and political impact of information."
      },
      "Youth Services & Librarianship": {
        "Children's & Young Adult Literature": "The study of literature written for children and young adults.",
        "Information Literacy": "The ability to find, evaluate, organize, use, and communicate information in all its various formats.",
        "Public & Academic Librarianship": "The practice of librarianship in public and academic libraries."
      }
    }
  },
  "College of Education": {
    "Curriculum & Instruction": {
      "Bilingual & ESL Education": {
        "Bilingualism & Biliteracy": "The study of the acquisition and use of two or more languages.",
        "Second Language Acquisition": "The study of how people learn a second language.",
        "Culturally Sustaining Pedagogy": "Teaching practices that perpetuate and foster linguistic, literate, and cultural pluralism."
      },
      "Digital Learning": {
        "Learning Technologies": "The design and use of technology to enhance learning.",
        "Online & Blended Learning": "The study of learning that takes place partially or fully online.",
        "Computational Thinking in K-12": "The integration of computational concepts into K-12 education."
      },
      "Literacy Studies": {
        "Early & Adolescent Literacy": "The study of literacy development in children and adolescents.",
        "Digital & Media Literacy": "The ability to access, analyze, evaluate, and create media in a variety of forms.",
        "Reading & Writing Pedagogy": "The study of the methods of teaching reading and writing."
      },
      "STEM Education": {
        "Mathematics Education": "The study of the teaching and learning of mathematics.",
        "Science Education": "The study of the teaching and learning of science.",
        "Engineering & Technology Education": "The study of the teaching and learning of engineering and technology."
      }
    },
    "Educational Psychology": {
      "Cognitive Science of Teaching & Learning": {
        "Learning Sciences": "An interdisciplinary field that studies teaching and learning.",
        "Motivation & Engagement": "The study of the factors that motivate students to learn and engage in school.",
        "Educational Neuroscience": "The study of the neural basis of learning and education."
      },
      "Counseling Psychology": {
        "Mental Health & Well-being": "The promotion of mental health and the prevention and treatment of mental illness.",
        "Vocational Psychology": "The study of career development and work-related issues.",
        "Multicultural Counseling": "The practice of counseling that is sensitive to the cultural backgrounds of clients."
      },
      "Developmental Sciences": {
        "Cognitive & Social Development": "The study of the development of thinking, social skills, and personality across the lifespan.",
        "Atypical Development": "The study of developmental disorders such as autism and ADHD.",
        "Lifespan Development": "The study of human development from conception to death."
      },
      "Quantitative & Evaluative Methods": {
        "Psychometrics & Measurement": "The theory and technique of psychological measurement.",
        "Educational Statistics": "The application of statistical methods to educational research.",
        "Program Evaluation": "The systematic assessment of the merit, worth, and significance of a program."
      }
    },
    "Education Policy, Organization & Leadership": {
      "Educational Policy Studies": {
        "Politics of Education": "The study of the political processes that shape education policy.",
        "Economics of Education": "The study of the economic issues related to education.",
        "History & Philosophy of Education": "The study of the historical and philosophical foundations of education."
      },
      "Higher Education": {
        "College Student Development": "The study of the intellectual, social, and personal development of college students.",
        "Higher Education Administration": "The management of colleges and universities.",
        "Diversity & Equity in Higher Ed": "The study of issues of diversity and equity in higher education."
      },
      "Human Resource Development": {
        "Workplace Learning & Training": "The design and delivery of training programs in the workplace.",
        "Organizational Development": "The process of improving organizational effectiveness.",
        "Global Human Resources": "The management of human resources in a global context."
      }
    },
    "Special Education": {
      "Autism & Developmental Disabilities": {
        "Intervention & Support Strategies": "The development and evaluation of interventions for individuals with autism and other developmental disabilities.",
        "Communication & Social Skills": "The teaching of communication and social skills to individuals with disabilities.",
        "Transition to Adulthood": "The process of preparing students with disabilities for life after high school."
      },
      "Learning Disabilities": {
        "Reading & Math Disabilities": "The study of the causes and treatment of learning disabilities in reading and math.",
        "Assistive Technology": "The use of technology to assist individuals with disabilities.",
        "Cognitive & Neuropsychological Bases": "The study of the cognitive and neuropsychological basis of learning disabilities."
      },
      "Inclusive Education": {
        "Differentiated Instruction": "The practice of tailoring instruction to meet individual needs.",
        "Positive Behavior Support": "A proactive approach to managing challenging behavior.",
        "Teacher Preparation for Inclusion": "The preparation of teachers to work in inclusive classrooms."
      }
    }
  },
  "College of Law": {
    "Legal Studies": {
      "Business & Commercial Law": {
        "Corporate Law": "The law governing corporations and other business entities.",
        "Bankruptcy": "The law governing the process of resolving the debts of individuals and businesses that cannot pay their creditors.",
        "Securities Regulation": "The law governing the issuance and trading of securities.",
        "Commercial Transactions": "The law governing commercial transactions, such as sales and leases."
      },
      "Constitutional & Public Law": {
        "Constitutional Law": "The law that defines the powers of the government and the rights of citizens.",
        "Administrative Law": "The law that governs the activities of administrative agencies of government.",
        "Election Law": "The law that governs the process of elections.",
        "Legislation & Statutory Interpretation": "The study of the process of creating laws and the principles of interpreting them."
      },
      "Criminal Law & Procedure": {
        "Substantive Criminal Law": "The branch of law that defines crimes and provides for their punishment.",
        "Criminal Procedure": "The body of law that regulates the process by which criminal laws are enforced.",
        "Sentencing & Corrections": "The study of the punishment of convicted criminals."
      },
      "Intellectual Property & Technology Law": {
        "Patent Law": "The law that protects inventions.",
        "Copyright Law": "The law that protects works of authorship, such as books and music.",
        "Trademark Law": "The law that protects brand names and logos.",
        "Cyberlaw & Information Policy": "The law that governs the internet and information technology."
      },
      "International & Comparative Law": {
        "Public International Law": "The law that governs relations between states.",
        "International Human Rights": "The body of law that protects the fundamental rights of all human beings.",
        "Comparative Constitutional Law": "The study of the constitutional law of different countries.",
        "International Business Transactions": "The law that governs business transactions that cross national borders."
      },
      "Taxation & Employee Benefits": {
        "Federal Income Taxation": "The law that governs the federal income tax.",
        "Corporate & Partnership Taxation": "The law that governs the taxation of corporations and partnerships.",
        "Employee Benefits (ERISA)": "The law that governs employee benefit plans, such as pensions and health insurance.",
        "Estate & Gift Taxation": "The law that governs the taxation of transfers of wealth."
      }
    }
  },
  "College of Applied Health Sciences": {
    "Kinesiology & Community Health": {
      "Biomechanics": {
        "Locomotion & Gait Analysis": "The study of human movement, particularly walking and running.",
        "Injury Biomechanics": "The study of the mechanical causes of injuries.",
        "Rehabilitation Engineering": "The application of engineering principles to the design of devices to assist individuals with disabilities."
      },
      "Community Health": {
        "Epidemiology": "The study of the distribution and determinants of health and disease in populations.",
        "Health Behavior & Promotion": "The study of the factors that influence health behaviors and the development of interventions to promote healthy behaviors.",
        "Public Health Policy": "The study of the laws, regulations, and policies that affect the health of populations."
      },
      "Exercise Physiology": {
        "Cardiovascular Physiology": "The study of the function of the heart and blood vessels.",
        "Metabolism & Obesity": "The study of the chemical processes that occur in the body and the causes and consequences of obesity.",
        "Physical Activity & Aging": "The study of the effects of physical activity on the aging process."
      },
      "Kinesiology": {
        "Motor Control & Learning": "The study of how the nervous system controls movement and how motor skills are learned.",
        "Exercise Psychology": "The study of the psychological factors that influence participation in physical activity.",
        "Adapted Physical Activity": "The promotion of physical activity for individuals with disabilities."
      }
    },
    "Speech & Hearing Science": {
      "Audiology": {
        "Hearing Science": "The study of the anatomy, physiology, and psychoacoustics of the auditory system.",
        "Auditory Processing Disorders": "The study of disorders that affect the brain's ability to process auditory information.",
        "Hearing Aids & Cochlear Implants": "The study of the technology and use of devices to assist individuals with hearing loss."
      },
      "Language Science": {
        "Language Development & Disorders": "The study of how language develops in children and the disorders that can affect language development.",
        "Psycholinguistics": "The study of the psychological processes involved in language.",
        "Bilingualism & Second Language Acquisition": "The study of the acquisition and use of two or more languages."
      },
      "Neuroscience of Communication": {
        "Neural Bases of Speech & Language": "The study of the brain mechanisms that underlie speech and language.",
        "Neurogenic Communication Disorders (e.g., Aphasia)": "The study of communication disorders that result from damage to the nervous system.",
        "Cognitive Hearing Science": "The study of the cognitive processes involved in hearing."
      },
      "Speech-Language Pathology": {
        "Speech Sound Disorders": "The study of disorders that affect the production of speech sounds.",
        "Voice & Fluency Disorders": "The study of disorders that affect the voice and the fluency of speech.",
        "Swallowing Disorders (Dysphagia)": "The study of disorders that affect the ability to swallow."
      }
    }
  },
  "College of Fine & Applied Arts": {
    "Architecture": {
      "Architectural History & Theory": {
        "Modern & Contemporary Architecture": "The study of architecture from the late 19th century to the present.",
        "Vernacular Architecture": "The study of traditional, local building styles.",
        "Preservation & Heritage": "The practice of preserving and protecting historic buildings and sites."
      },
      "Building Performance": {
        "Energy Efficiency & Sustainability": "The design of buildings that use less energy and have a smaller environmental impact.",
        "Structural Technology": "The study of the materials and methods used to build structures.",
        "Building Materials & Envelopes": "The study of the materials used to construct the exterior of buildings."
      },
      "Design & Urbanism": {
        "Urban Design": "The design of the physical features of cities.",
        "Digital Fabrication": "The use of computer-controlled machines to build objects.",
        "Social Impact Design": "The practice of using design to address social problems."
      },
      "Health & Well-being": {
        "Healthcare Design": "The design of healthcare facilities, such as hospitals and clinics.",
        "Environments for Aging": "The design of environments that are safe and comfortable for older adults.",
        "Lighting & Daylighting": "The design of lighting systems that use both artificial and natural light."
      }
    },
    "Landscape Architecture": {
      "Cultural Heritage": {
        "Cultural Landscape Preservation": "The preservation of landscapes that have cultural or historical significance.",
        "Landscape History & Theory": "The study of the history and theory of landscape design.",
        "Urban Heritage": "The preservation of the historic character of cities."
      },
      "Ecological Design": {
        "Stormwater Management & Green Infrastructure": "The design of systems to manage stormwater runoff and use natural systems to provide environmental benefits.",
        "Ecological Restoration": "The practice of restoring damaged ecosystems.",
        "Sustainable Site Design": "The design of sites that have a minimal environmental impact."
      },
      "Social & Environmental Justice": {
        "Community-Engaged Design": "The practice of working with communities to design projects that meet their needs.",
        "Public Space & Equity": "The design of public spaces that are accessible and equitable for all people.",
        "Environmental Justice": "The fair treatment and meaningful involvement of all people regardless of race, color, national origin, or income with respect to the development, implementation, and enforcement of environmental laws, regulations, and policies."
      }
    },
    "Urban & Regional Planning": {
      "Community Development": {
        "Housing & Real Estate": "The planning and development of housing and real estate.",
        "Economic Development": "The creation of wealth from which community benefits are realized.",
        "Social Planning & Policy": "The planning of social services and policies."
      },
      "Environmental Planning": {
        "Land Use & Environmental Quality": "The planning of land use to protect environmental quality.",
        "Sustainable Development": "Development that meets the needs of the present without compromising the ability of future generations to meet their own needs.",
        "Climate Action Planning": "The development of plans to reduce greenhouse gas emissions and adapt to the impacts of climate change."
      },
      "Transportation Planning": {
        "Transportation Systems Analysis": "The analysis of transportation systems to improve their efficiency and effectiveness.",
        "Public Transportation": "The planning and operation of public transportation systems.",
        "Active Transportation (Walking/Biking)": "The planning of infrastructure to support walking and biking."
      }
    }
  }
}